[
    {
        "user": "DammitMorty01",
        "user_ID": "76561199571798657",
        "country": "US",
        "date": "26-11-2024",
        "review": "its very fun and u get to unlock now people and ya"
    },
    {
        "user": "Bone",
        "user_ID": "76561198347450672",
        "country": "PH",
        "date": "26-11-2024",
        "review": "Ass game"
    },
    {
        "user": "Pinku_noTori #FixTF2 #SaveTF2",
        "user_ID": "76561198132888199",
        "country": "KZ",
        "date": "26-11-2024",
        "review": "Nice, wish battlepass had more rewards for f2ps though"
    },
    {
        "user": "Jojo!",
        "user_ID": "76561198045004220",
        "country": "US",
        "date": "26-11-2024",
        "review": "it works"
    },
    {
        "user": "Dealer",
        "user_ID": "76561198859438062",
        "country": "Private",
        "date": "26-11-2024",
        "review": "MOLTEN CORE !!!!!!!!!!!!!!!"
    },
    {
        "user": "Alex",
        "user_ID": "76561198098565783",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Product received for free\n\nOk so where do i start...\n\nFirst off this game is a joke and was made by what i would call \"insane people\" and clearly people who have 0 experience in making money or in video game business industry.\n\nHave you ever played a game with someone who has a gun next to your face ? Because that's what playing a Blizzard activision game is.\n\n- If you afk or leave a game because your team is trolling, braindead or bad you will get penalty like not be able to play the game for an amount of time. (from 2 mins to a week or more even)\n\n- If you speak on the voice chat, if you type stuff even if you have fun or trying to make people laugh you will get a ban because Blizzard had the great idea to ban the community thanks to a random ban bot that will ban everyone for no reasons.\n\n- I reported people randomly just to see if the ban system was actually this insane and turns out i ban over 10 peoples a day because everytime i report people 1/3 i get a message from Blizzard bot saying thanks for the report thanks to you we blablabla ban that person.\n\n- The game is free to play sure but you will never ever get a skin in game since they removed Lootbox and everything needs money dosh cash to get anything, but who would put money in this game since everyone gets a ban? Don't believe me? check out the OW2 forums or steam hub to see how much people get a perma ban for no reasons.\n\n-Blizzard is by far in my opinion the worst \"company\" the video game industry has ever seen, they let every game die because they only care for money there is no passion since 90% of blizzard devs got fired or left the company (even the creator of overwatch left blizzard). Once they don't bring enough money such as starcraft, heroes of the storm and soon overwatch 2, instead of making small updates or balancing the games they just ignore the community and punish them like i said before.\n\n- This game is fun if you got time to waste, if you don't care about anything in it because let's be honest this game is unbalance/chaotic and impossible to win by yourself even if you're a genius with 300IQ you will never be able to go all by yourself more than diamond rank in competition and if you love pure toxic. I mean if i did drugs and alcohol i couldn't make this game more unbalance and chaotic as it is right now it's actually impressive how much they destroyed it.\n\n-Like i said this game is fun if you really got nothing else to play, if you don't care about anything in the game and if you're waiting for another game like marvel rivals to come out for example. But if you care about the game, want to play competition and rank up good luck to you because unless you got asians with 180 IQ as a full team you will never ever win no mather how hard you try or play.\n\n-the gameplay is 10% skill 90% luck based on random people you play with, either you are good and everyone is bad or the other way around. 9/10 games you will lose randomly and ask yourself what is the problem? me or the others no idea since everyone blames the fault on each others.\n\nSo long story short instead of supporting people who play the game and make money, blizzard was like:\n\n-remove lootbox.\n- ban 90% of people who play the game so basically 90% of people on overwatch are alt accounts or cheaters now.\n-nobody talks or use voice chat because of the ban bot.\n-the devs of this game all left long time ago even the creator because of blizzard.\n\nThis company changed ceo 5x in less than 3 years, i wonder why....(sarcasm) and now they sold it to microsoft for 66 billions or some sh*t who has no idea what to do with this \"company\" just because bill gates was like i got too much money i wanna buy some dead company.\n\nBut yeah Blizzard only has WoW now (that i never liked or played because who plays that sh*t maybe insane people and maso people who haven't seen the sun in 30 years but even then that's not sure) few more years till the company completely dies and will change to microsoft.\n\nA big fall for what used to be a big company 20 years ago.\n\nMoral of story, don't be greedy money isn't everything.\n\nThanks for reading my review !"
    },
    {
        "user": "chrizz",
        "user_ID": "krislalala",
        "country": "Private",
        "date": "26-11-2024",
        "review": "monke see, monke do"
    },
    {
        "user": "tobiking",
        "user_ID": "76561199271102105",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Product received for free\n\npretty cool"
    },
    {
        "user": "Certified Autism",
        "user_ID": "Aurellu",
        "country": "Private",
        "date": "26-11-2024",
        "review": "where is PVE that you guys promised"
    },
    {
        "user": "mysfeori",
        "user_ID": "76561199074058463",
        "country": "Private",
        "date": "26-11-2024",
        "review": "miserable ♥♥♥♥♥♥♥ experience, they should force prisoners to play this game as a form of capital punishment,"
    },
    {
        "user": "Hosenbund",
        "user_ID": "76561198062561498",
        "country": "DE",
        "date": "26-11-2024",
        "review": "Still the same old boring casual game pretending to be a competetive game"
    },
    {
        "user": "Will",
        "user_ID": "76561198348138328",
        "country": "FI",
        "date": "26-11-2024",
        "review": "It's okay, the queue times are crazy tho."
    },
    {
        "user": "Space King Dave",
        "user_ID": "spacekingdave",
        "country": "Private",
        "date": "26-11-2024",
        "review": "I LOVE THIS GAME\n\nIT MAKES ME WANT TO DIE"
    },
    {
        "user": "! Woodhouse",
        "user_ID": "76561198297500883",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Play marvel rivals instead."
    },
    {
        "user": "lexlog",
        "user_ID": "76561199220071464",
        "country": "Private",
        "date": "26-11-2024",
        "review": "nerf bastion hes to op without a genji"
    },
    {
        "user": "morien_thegreat64",
        "user_ID": "76561199133179292",
        "country": "Private",
        "date": "26-11-2024",
        "review": "bawb"
    },
    {
        "user": "ZachIsWack21",
        "user_ID": "76561199273706131",
        "country": "US",
        "date": "26-11-2024",
        "review": "new player, cant even get into the game cause the sms screen is glitched. even if i figure it out this is ridiculous making me have to go through this process just to play this ♥♥♥♥♥♥♥♥. at least we'll have marvel rivals on the 6th"
    },
    {
        "user": "QsA",
        "user_ID": "76561199198547468",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Game has turned soft, you cant banter in chat without getting banned. Not even talking about slurs or curse words. Just regular game banter gets you banned when there is an option for every player to mute or block other players. Such a \"competitive\" game."
    },
    {
        "user": "testicle inspector",
        "user_ID": "76561199162065412",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Honestly, ♥♥♥♥ this game.\nThe English language does not have the words to describe what anger and deep hatred I have towards this game, I cant play this game for more than 10 minutes without getting pissed. you either get ♥♥♥♥♥♥ in the ass by Mauga or brutally raped by a Moira. I hate this game with a deep passion, I honestly considered throwing my whole computer and monitor out my window on several occasions. ♥♥♥♥ the devs and ♥♥♥♥ blizzard, Your games give me nothing but torment and physiological harm. Playing this game is the most agonising, infuriating, mind numbing sould crushing experience. This paragraph is the bare minimum of what I feel, I am holding back. ♥♥♥♥ this game."
    },
    {
        "user": "Samny",
        "user_ID": "76561198447324100",
        "country": "SE",
        "date": "26-11-2024",
        "review": "Forgot I had a battlenet account and tried creating a new one, then, realised I need a ♥♥♥♥♥♥♥ SMS verification to access the game, so I try changing account in the app, can't change account, then try delinking my phone number from my old account and linking it to my new account, game says that the phone number has already been used for another account so I cant use it, and promptly closes the game. ♥♥♥♥ you blizzard. You're not getting another second of my time. ♥♥♥♥ off. ♥♥♥♥ game."
    },
    {
        "user": "Ginger Jesus",
        "user_ID": "76561199036684890",
        "country": "Private",
        "date": "26-11-2024",
        "review": "This game is such a waste of time. Toxic useless teamates and you'll get perm banned for saying gg"
    },
    {
        "user": "koibitokokoro",
        "user_ID": "76561198958012362",
        "country": "Private",
        "date": "26-11-2024",
        "review": "GAME WOULD NOT OPEN FOR ♥♥♥♥"
    },
    {
        "user": "meat beat mania",
        "user_ID": "DokkaDokka",
        "country": "Private",
        "date": "26-11-2024",
        "review": "They didnt add the cosby room"
    },
    {
        "user": "ᵛᵒʸˡᵃʰ",
        "user_ID": "voylah",
        "country": "Private",
        "date": "26-11-2024",
        "review": "make more kiriko skins"
    },
    {
        "user": "Loki",
        "user_ID": "codeHusky",
        "country": "Private",
        "date": "26-11-2024",
        "review": "this game SUCKS. I would NOT recommend it to a friend. do NOT play again."
    },
    {
        "user": "DonutTime",
        "user_ID": "76561198827747091",
        "country": "Private",
        "date": "26-11-2024",
        "review": "it aint as bad as they say"
    },
    {
        "user": "Johnquaviontanious",
        "user_ID": "76561199528721777",
        "country": "US",
        "date": "26-11-2024",
        "review": "I have fun playing...... sometimes, but I definitely have more fun jorking it to Juno, Kiriko, and Widowmaker!"
    },
    {
        "user": "kwas",
        "user_ID": "76561199139135178",
        "country": "GB",
        "date": "26-11-2024",
        "review": "no"
    },
    {
        "user": "Iraqlobster",
        "user_ID": "Watermellonnnn",
        "country": "Private",
        "date": "26-11-2024",
        "review": "ass"
    },
    {
        "user": "durrsqurtle123",
        "user_ID": "76561199530626840",
        "country": "Private",
        "date": "26-11-2024",
        "review": "original was better"
    },
    {
        "user": "godgonewicked",
        "user_ID": "76561198819173661",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Terrible game they just keep making it worse and pumping out skins for money oh and youll get banned for no reason too and lose whatever money you spent on game:)"
    },
    {
        "user": "Terminall",
        "user_ID": "terminall_",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Most unbalanced piece of ♥♥♥♥ game ever."
    },
    {
        "user": "kyle morrison",
        "user_ID": "MILKPWN",
        "country": "Private",
        "date": "26-11-2024",
        "review": "i hate it"
    },
    {
        "user": "Vali",
        "user_ID": "sixkt",
        "country": "Private",
        "date": "26-11-2024",
        "review": "This game makes you want to cut your balls and feed them to your dog. 10/10 do not recommend"
    },
    {
        "user": "nxah",
        "user_ID": "wakiejakie",
        "country": "Private",
        "date": "26-11-2024",
        "review": "if youre suicidal!"
    },
    {
        "user": "GrayPancakes",
        "user_ID": "76561198982570261",
        "country": "Private",
        "date": "26-11-2024",
        "review": "wont let me play"
    },
    {
        "user": "Kyler",
        "user_ID": "76561198438333399",
        "country": "US",
        "date": "26-11-2024",
        "review": "game bad"
    },
    {
        "user": "THE INDUSTRIAL REVOLUTION",
        "user_ID": "76561199059764461",
        "country": "CF",
        "date": "26-11-2024",
        "review": "they lobotomized the cowboy"
    },
    {
        "user": "dionysusxian",
        "user_ID": "arizonadietgreentea",
        "country": "Private",
        "date": "26-11-2024",
        "review": "wonderful game but i hate it its stupid change it back. been playing since 2017. picked it back up just today. steam says review? i review."
    },
    {
        "user": "› Rizzo",
        "user_ID": "iamrizzo",
        "country": "Private",
        "date": "26-11-2024",
        "review": "There's just something that fundamentally is off with this game. Even installing and coming back online to play 'Overwatch: Classic' and it truly, honestly, dead ass, doesn't feel the same way that Overwatch did when it initially was released all those years ago. I wish I could put my finger on it, but there's honestly so much wrong that it would take an entire hand, foot, and elbow.\n\nOn a scale from 1 to 10, I rate it a solid 'meh'."
    },
    {
        "user": "Bartholomew",
        "user_ID": "76561198119287420",
        "country": "CA",
        "date": "26-11-2024",
        "review": "overwat"
    },
    {
        "user": "Krouton",
        "user_ID": "76561199501455457",
        "country": "US",
        "date": "26-11-2024",
        "review": "Look I dont really know the game well but evryone else is disliking it so I think imma do the same"
    },
    {
        "user": "Rooster",
        "user_ID": "kwk",
        "country": "Private",
        "date": "26-11-2024",
        "review": "no"
    },
    {
        "user": "iSellMemes",
        "user_ID": "76561199442392319",
        "country": "SG",
        "date": "26-11-2024",
        "review": "."
    },
    {
        "user": "woozipou",
        "user_ID": "woozipou",
        "country": "Private",
        "date": "26-11-2024",
        "review": "i cant stand this game. i hate it and i cant stop plsying"
    },
    {
        "user": "EvieTwos",
        "user_ID": "76561198972332330",
        "country": "Private",
        "date": "26-11-2024",
        "review": "people are mean"
    },
    {
        "user": "Killinitraw",
        "user_ID": "76561199798697436",
        "country": "US",
        "date": "26-11-2024",
        "review": "Product received for free\n\nThis is a great game to play but only real when you play with strangers!"
    },
    {
        "user": "Big Monke",
        "user_ID": "76561198126309286",
        "country": "US",
        "date": "26-11-2024",
        "review": "No futa widowmaker skin."
    },
    {
        "user": "austin1030Z",
        "user_ID": "76561199576971791",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Product received for free\n\nThis game is very fun and all of the heroes are very different. It is very well made when it comes to graphics and abilities, I encourage people over the age of 10 to get this game."
    },
    {
        "user": "ryanritt",
        "user_ID": "cameronisajew",
        "country": "Private",
        "date": "26-11-2024",
        "review": "I've seen other reviews describe this game as an abusive relationship and that is the perfect description. Despite how much it frustrates me I come back for more and I cant stop. In all honesty though my main gripe with this game is how bad the matchmaking is. Lots of smurfs, and trash players out there that just ruin your night often times."
    },
    {
        "user": "Oven_The_Consumer",
        "user_ID": "76561198987958391",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Blizzard (Derogatory)"
    },
    {
        "user": "souleatingfurry",
        "user_ID": "76561199011970758",
        "country": "Private",
        "date": "26-11-2024",
        "review": "the chargeman ken of videogaming"
    },
    {
        "user": "れんごく",
        "user_ID": "76561198395584226",
        "country": "JP",
        "date": "26-11-2024",
        "review": "nice"
    },
    {
        "user": "gamer x",
        "user_ID": "71645",
        "country": "Private",
        "date": "26-11-2024",
        "review": "cant stop playying"
    },
    {
        "user": "El Pachas",
        "user_ID": "densidad",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Esta bien culero"
    },
    {
        "user": "Miner Toucher",
        "user_ID": "ifyouseethishellohaveaniceday",
        "country": "Private",
        "date": "26-11-2024",
        "review": "SUFFER, AS I HAVE"
    },
    {
        "user": "cphamrah",
        "user_ID": "76561199268021530",
        "country": "Private",
        "date": "26-11-2024",
        "review": "Yesn't"
    },
    {
        "user": "Steveo's Mimic",
        "user_ID": "76561199536276595",
        "country": "US",
        "date": "26-11-2024",
        "review": "This game makes me wish I never bought it all those years ago cause now I realize I could have been happier if I didn't. I like the edge boi 9/10"
    },
    {
        "user": "Speccy",
        "user_ID": "Spec_tr",
        "country": "Private",
        "date": "26-11-2024",
        "review": "like 500h on Overwatch 1\nthey didn't cook with this one at all"
    },
    {
        "user": "Halfro_",
        "user_ID": "76561199092990475",
        "country": "US",
        "date": "26-11-2024",
        "review": "this is only positive for 6v6. The rest of this game is horribly balanced garbage. Damage is unplayable and meaningless in modern 5v5. Supports and Tank would be the only roles played if not for role queue, antiheal passive is a meaningless addition. play 6v6 only."
    },
    {
        "user": "Smoking2Joints",
        "user_ID": "ConditionOfMan",
        "country": "Private",
        "date": "26-11-2024",
        "review": "There really is no good game play here, it's just people spamming skills on cooldown and running it down solo."
    },
    {
        "user": "DZ",
        "user_ID": "76561199467258252",
        "country": "Private",
        "date": "26-11-2024",
        "review": "I hate on this game even though I never play it 10/10"
    },
    {
        "user": "Aenris",
        "user_ID": "Aenris",
        "country": "Private",
        "date": "25-11-2024",
        "review": "TLDR: It works, it's not terrible anymore\n\n- They removed the \"unlock hero to be able to play\" monetization idea. All heroes are avaivable as soon as t hey release\n- Battle pass is annoying, but keeps the game free\n- 1 Tank reduced Role queque so much that in less than 2 minutes you can find a game.\n- All abilities that had a stun or something to keep you in place (Cassidy's grenade, Mei's freeze weapon, Briggitte shield bash) have been removed. The only ability that can still stop ultimates is Ana's sleep dart (and it's still very difficult to hit)\n- 2CP maps were removed. And while I was kinda sad to let Hanamura go... I remembered the excruciating hours of being stuck on Volskaya, Temple of Anubis or other maps for 10 minutes at the time withouth being able to make any progress.\n- Counterpicking is not as easy or direct? some heroes can still win vs their counters, with some strategy or being careful. You didn't automatically lose a game if you play Pharah and the enemy changes to a Cassidy for example.\n- The new game modes are short and fun. Nothing like 2CP.\n\nOverall, the game works. It's fun. It's not as unfair. It's not as cheap. Reapers and Sombras are annoying but they're more or less counterable. The battle pass is annoying? absolutely, but hey, it's just skins. I'm a gameplay person and gameplay works well enough.\n\nIf you liked OW1 when it wasn't plagued by GOATS, then you'll like OW2 nowadays. Call your friends, pick a role, good luck, have fun.\n\n(and if you don't like it... it's a free game, nothing to lose right?)"
    },
    {
        "user": "Shadow ☭",
        "user_ID": "76561199509427089",
        "country": "PT",
        "date": "25-11-2024",
        "review": "Product received for free\n\nNot Sigma"
    },
    {
        "user": "gunner.butt",
        "user_ID": "76561199437889389",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Product received for free\n\nwhy the hell is this game mostly negative is honestly super fun, AND ITS FREE"
    },
    {
        "user": "penguinpowers",
        "user_ID": "penguinpowerss",
        "country": "Private",
        "date": "25-11-2024",
        "review": "fun"
    },
    {
        "user": "HEX: クリス・キャン・サ",
        "user_ID": "76561199089499859",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I threw my grandpa's dentures across the room because of this game, get it before He licks your middle crusty toe at 3:00 am exactly"
    },
    {
        "user": "VOREme",
        "user_ID": "76561198363179376",
        "country": "US",
        "date": "25-11-2024",
        "review": "its just a shell of its former self bad game don't download"
    },
    {
        "user": "Chumly?",
        "user_ID": "76561199491407060",
        "country": "US",
        "date": "25-11-2024",
        "review": "i actually fw this game ngl"
    },
    {
        "user": "Sam",
        "user_ID": "76561198813274653",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I literally only play this game cause its the only shooter I actually enjoy. If a game came out that was a better version of overwatches play style I would not be playing this ♥♥♥♥♥ game. Not to mention the company being the biggest pieces of ♥♥♥♥ on the planet"
    },
    {
        "user": "pyrokirb",
        "user_ID": "76561199130168009",
        "country": "US",
        "date": "25-11-2024",
        "review": "Product received for free\n\nPeople on this game are really toxic"
    },
    {
        "user": "SirJoeDoe",
        "user_ID": "SirJoeDoe",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I'm developing addiction"
    },
    {
        "user": "Angel ‹𝟹",
        "user_ID": "katsemo",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I have been playing since 2017.\nAlmost 3000 hours in total, 1000 only on Mercy.\nMy existence is filled with pain. I will never stop playing this game.\n\nPlease send help."
    },
    {
        "user": "Froggy",
        "user_ID": "76561199095335221",
        "country": "Private",
        "date": "25-11-2024",
        "review": "this game is fun"
    },
    {
        "user": "liver failure",
        "user_ID": "dyotton",
        "country": "Private",
        "date": "25-11-2024",
        "review": "You either get really good teammates or get bot ass teammates."
    },
    {
        "user": "Rogue Martin",
        "user_ID": "Rogue_Martin",
        "country": "Private",
        "date": "25-11-2024",
        "review": "It ALMOST beats mental manipulation and abuse:)"
    },
    {
        "user": "Frosty",
        "user_ID": "FrostyChickenNuggets",
        "country": "Private",
        "date": "25-11-2024",
        "review": "yeah this game is ass"
    },
    {
        "user": "cdnty",
        "user_ID": "realcdnty",
        "country": "Private",
        "date": "25-11-2024",
        "review": "can orisa get her spear out of my arse the fat ♥♥♥♥♥"
    },
    {
        "user": "frustrated",
        "user_ID": "76561199216114627",
        "country": "Private",
        "date": "25-11-2024",
        "review": "There are a million problems in the game, the main one is the lack of balance"
    },
    {
        "user": "PizzaParker",
        "user_ID": "tangoiceblast12",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Worst game I've ever played. I would rather be castrated chemically whilst being shot simultaneously with a rifle and having my eyes gouged out with two knives over playing one more round of this piece of ♥♥♥♥♥♥♥ ♥♥♥♥ ♥♥♥♥♥♥♥ game. ♥♥♥♥ you blizzard I hope you and all your employees rot in the deepest pits of hell."
    },
    {
        "user": "rubberman8124",
        "user_ID": "76561197977574169",
        "country": "US",
        "date": "25-11-2024",
        "review": "this game is so buns bro please make it better"
    },
    {
        "user": "IZELDO",
        "user_ID": "76561198079126908",
        "country": "Private",
        "date": "25-11-2024",
        "review": "ไม่เหมาะสำหรับผู้เล่น solo อย่างมาก"
    },
    {
        "user": "shrimpnoodles",
        "user_ID": "shrimpnoodles99",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I've got nothing to say that hasn't been said already. It's a pathetic excuse for a sequel.\n\nMiss u pre-2020 Overwatch </3"
    },
    {
        "user": "Zayn",
        "user_ID": "ZaynR3al",
        "country": "Private",
        "date": "25-11-2024",
        "review": "i love overwatch i cant sotp palgying"
    },
    {
        "user": "candyrushseb",
        "user_ID": "76561199487439710",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Beer!"
    },
    {
        "user": "Lobster",
        "user_ID": "76561198128883032",
        "country": "US",
        "date": "25-11-2024",
        "review": "They keep interrupting me playing flappy mercy with a battle pass grind mode"
    },
    {
        "user": "lee61108",
        "user_ID": "76561199589264273",
        "country": "Private",
        "date": "25-11-2024",
        "review": "good game"
    },
    {
        "user": "Dr Pepper",
        "user_ID": "76561198970627765",
        "country": "US",
        "date": "25-11-2024",
        "review": "This game is responsible for my opioid addiction and I demand financial compensation from Blizzard so I can continue my substance abuse."
    },
    {
        "user": "Clue",
        "user_ID": "JameskiiTV",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Biggest piece of ♥♥♥♥♥♥♥ you could play rn and im not even kidding, if you ever get your hands on a time machine please message me ASAP, also i recommend you to play this game to keep it alive so Blizzard creates more porn worthy characters."
    },
    {
        "user": "Mike Oxmaul",
        "user_ID": "bogdanmn",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I am a 45 yo father, probably one of the oldest people playing this game. I am a single father to my Son, who is 14 now. My son got this game for Christmas in 2021 from his uncle, so we installed it on his computer and he started playing. By the end of the week he had 24 hours on this game. This was horrible for me, as it was already hard for me to find ways to spend time with my son, as he is always out with his friends or just watching YouTube. So i decided to make a Steam account and get this game to see if I could maybe play alongside him. I loaded into the game, picked my character and world and started playing but I was stuck on what you where supposed to do. I asked my Son for help and he hosted a game for me to join. I loved it as it was the best time I had spent with my Son since my wife had died. This game has ever since brought me and my son closer again and now we actually spend time together outside the house together as well. This game reminded me that there's fun to be had in everything, and it has brought both me and my Son many happy memories."
    },
    {
        "user": "buffy",
        "user_ID": "76561199202981725",
        "country": "NL",
        "date": "25-11-2024",
        "review": "♥♥♥♥ from a butt"
    },
    {
        "user": "Fine Gentleman",
        "user_ID": "76561198929710975",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I forgot to give this game a bad review"
    },
    {
        "user": "Mori",
        "user_ID": "76561198893179452",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Product received for free\n\ndont play"
    },
    {
        "user": "Packmate",
        "user_ID": "76561199017736558",
        "country": "US",
        "date": "25-11-2024",
        "review": "lowkey ass ngl"
    },
    {
        "user": "Limpa",
        "user_ID": "76561198867470794",
        "country": "LT",
        "date": "25-11-2024",
        "review": "Product received for free\n\nfart"
    },
    {
        "user": "Ankou",
        "user_ID": "BattleBuds",
        "country": "Private",
        "date": "25-11-2024",
        "review": "great, overwatch 1 was better but i like some of the character reworks like sombra and bastion."
    },
    {
        "user": "molested salmon",
        "user_ID": "76561199213691200",
        "country": "TD",
        "date": "25-11-2024",
        "review": "i dont likje this game"
    },
    {
        "user": "Andie Mano",
        "user_ID": "76561199058048927",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Game made me physically ill and almost hospitalized me."
    },
    {
        "user": "Misskitty",
        "user_ID": "Misskiok",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Overwatch 2 is a shadow of its former self that charges your card to turn on the light source that casts it. a once great pvp hero shooter has become a shop with a few minigames attached to it. thats it. content updates are few and far between unless its paid shop skins or the occasional battlepass which offers next to nothing of value, no longer even the seasons full attached mythic suite of new items"
    },
    {
        "user": "Adobe Illustrator",
        "user_ID": "paulr0090",
        "country": "Private",
        "date": "25-11-2024",
        "review": "MATCHMAKING IS SO BAD. IF U R IN PLAT U WILL GET SILVER PLAYER, BASICALLY THEIR MATCHMAKING IS ♥♥♥♥ UP ENEMY FULL PLAT WHERE IN YOUR TEAM U WILL GET 2 SILVER 1 GOLD I DON'T KNOW HOW ANY BODY CAN WIN THE MATCH LIKE THAT. AND MOST DISGUSTING PART IS COMMUNITY IS SO MUCH TOXIC. SOME HERO IS SO OP YOU CANT COUNTER IN TEAM FIGHT. TOTALLY DEAD GAME. PLAYED BY SOME TOXIC KIDS WHO SURRENDER AND WENT AFK AFTER DIED FIRST TIME. REPORT DOESN'T WORK, IT DOESN'T MATTER IF YOU REPORT A PLAYER BCZ OF GRIFING AND IDLE THEY DON'T BAN OR LONG MATCHING COOL-DOWN OR ANYTHING ELSE THE DEVS ARE WARMING THEIR SEAT THATS IT. IM PLAYING THIS GAME FOR 5+ YEARS AND THIS GETTING WORSE."
    },
    {
        "user": "Spewks",
        "user_ID": "Spewkie",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Its overwatch? its trash but its fun trash"
    },
    {
        "user": "Nests Kyo",
        "user_ID": "nestskyo98",
        "country": "Private",
        "date": "25-11-2024",
        "review": "even classic mode wont save this trash , gay game , gay devs , gay player base play TF2"
    },
    {
        "user": "courage the cowardly dog",
        "user_ID": "76561198987998292",
        "country": "TH",
        "date": "25-11-2024",
        "review": "Product received for free\n\nthis game so ♥♥♥♥♥♥ suck"
    },
    {
        "user": "kittyy",
        "user_ID": "kittyyevil",
        "country": "Private",
        "date": "25-11-2024",
        "review": "♥♥♥♥♥ ass support team that will ban you for saying the tamest insults ever."
    },
    {
        "user": "ikorra",
        "user_ID": "76561198955797036",
        "country": "Private",
        "date": "25-11-2024",
        "review": "ok look this game was my childhood but ♥♥♥♥ blizzard man"
    },
    {
        "user": "ガッツ The Struggler",
        "user_ID": "realgutsthestruggler",
        "country": "Private",
        "date": "25-11-2024",
        "review": "maw"
    },
    {
        "user": "evilmischiefcat",
        "user_ID": "EVILDEATHMURDER",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Literally got suspended for the second time despite not swearing, not hurling any kind of abuses and reporting others for doing such things. about the only things i actually said was '' ____ Diff '' or '' ____ Switch Characters '', I'm so very sick of this broken moderation system"
    },
    {
        "user": "MartinoWho",
        "user_ID": "MartinoWho",
        "country": "Private",
        "date": "25-11-2024",
        "review": "This game was fun, until Blizzard decided to just keep digging it into a deeper grave as time went by\n\nDue to poor decisions by the people behind this game, the lack of community support, and genuinely just a horrible decision to sunset the original Overwatch, I cannot recommend this game, I can however recommend the ungodly amounts of Overwatch R34."
    },
    {
        "user": "martin",
        "user_ID": "_goldenboy_",
        "country": "Private",
        "date": "25-11-2024",
        "review": "overwatch is fun to play with friends, but the long queue times for matches are really frustrating. the game’s all about squeezing cash from players, and it doesnt even try to hide it. grinding the battle pass is pure torture, and its tough for new players to get into"
    },
    {
        "user": "✟Popono Salesman✟",
        "user_ID": "PoponoDance",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Alright, let's actually provide a constructive review. Why are people \"review bombing\" Overwatch 2?\n\nWe paid for Overwatch, we supported it throughout its lifespan, it was popular and liked by its community, and turning a happy profit each year.\n\nWhen Blizzard announced Overwatch 2, the big new feature they announced, the entire premise that made it \"worth the sequel treatment\" was the PvE campaign mode. Hero talent trees, customizable abilities, an expansive co-op campaign that would add to the story and lore. We were told it was going to be so much work that they wouldn't be putting out updates for Overwatch any more, they were re-allocating the staff to work on this new project.\n\nWith no updates, and no content, Overwatch started to get stale... people grew tired and bored, spending less time in the game, or moving on. Many of us stuck with the product, playing a little each week just to keep fresh... waiting for the new campaign mode. For a lot of us, playing became a chore, something we were doing out of habit, so we'd be ready for the new campaign...\n\nBut the new campaign wasn't the premise that established OW2, it was the pretext. It was a lie. Blizzard abandoned the PvE campaign a full YEAR before OW2 launched - but continued to push it in marketing as the big new feature. It's even in the announcement trailer for OW2, and on the roadmaps. They knew they'd canned it 12 months earlier, but they knew that's what people wanted, so kept putting it front and centre to get people's money, to get people to buy into the project. They took our trust and monetized it.\n\n-----\n\nWhat does OW2 ACTUALLY offer then? What did they work on for those two years that was so important that they couldn't make content for OW1, the product people paid for and were supporting?\n\n1) They overhauled the graphical engine:\n\nBefore, Overwatch would play on a relatively low spec computer, and it'd be smooth. Now, it stutters and stammers in the menus. They've added this weird shiny plastic finish to everything in the world, heroes and environment alike - so where before, heros would \"pop\" against the background and be easy to follow, now everything has the same texture to it, and it all merges together into visual noise - especially at longer ranges. They've compensated for how bad this looks by adding lots of additional flashy effects and explosions, that makes it much harder to see anything amidst the chaos. A PvP game at this pace relies heavily on quick disambiguation of what you're looking at, so you can react and compete, and the new engine makes this impossible without turning all the effects back off... meaning that the two years of development is for a feature best disabled.\n\nThe new engine also has a weird slippery \"feel\" to it. Reviewers who'd played Overwatch for 50 hours came into Overwatch 2 and reported \"look! it's the same Overwatch you love, but it's F2P now! Just ignore the monetization and you can play this great game for free!\" Established long term players with thousands of hours were on reddit complaining that their hitboxes were all over the place and shots that would previously \"feel\" like a dead certain hit were just completely whiffing, and they didn't understand why. All the timings are messed up.\n\n2) They reworked most of the heroes:\n\nTLDR: they screwed up the game balance. Previously, one of the biggest appeals of Overwatch was that you could find a hero that suited your play style, and main them, getting good at whatever suited you best. Some people like sniping, or hitscan run and gun, some people aren't good at reactionary aim and instead liked to focus on positioning, tactics and strategy. You could make a big positive different to your team by playing lucio or mercy, and paying attention to your surroundings, and positioning yourself in the right place at the right time to make the difference.\n\nWith Overwatch 2, the damage and healing behaviour has been reworked heavily. Now, the one tank on the team is insanely chunky, and it's near impossible to kill them quickly - with healer support, they can just stand in the line of fire and laugh. Everyone else dies almost immediately, regardless of who their aggressor is.\n\nTeam-fighting now is very one-note, you have one tank who's immortal if they have support, and you have four hitscan DPS characters following them - there's not a lot of difference between supports and DPS characters. The teams try to pick off the other team's DPS/Support characters, and when they pick a few off, they can finish the tank and take the objective. Repeat. There's no room for variation in play style at all, you either play a DPS and try to kill the other team DPS, or you play a tank, and try to position correctly - maybe picking off an enemy hero that gets too close to you.\n\nI understand a lot of this came from feedback at the professional levels, where support players were complaining that they wanted to have more direct impact in teamfights, they wanted the game to feel more like other FPS games - but for a large portion of Overwatch's playerbase specifically, the appeal of the game was that you could do something else and still matter.\n\n3. They got INCREDIBLY greedy with the monetization...\n\nIt's a longstanding argument that lootboxes are terrible in modern gaming... but Overwatch was one of the few examples of Lootboxes done right. Most of the long-term players of the game actually liked the system, that just rewarded you for playing the game and let you unlock whatever content you wanted relatively quickly. I started playing OW1 with the first anniversary, cleared the weekly boxes from arcade every week, and at the launch of OW2, I owned every single item in the game. Those who didn't have the time to invest in doing everything could still quickly unlock specific items they wanted (and let's be honest, when you have your favourite skin, how much do you care about unlocking other skins?) - and those who didn't want to spend hours unlocking stuff could spend a little cash to get it - if they wanted to.\n\nThe new system puts almost everything behind a paywall. The minute number of cosmetics on the \"free\" track are often insultingly lazy, simple recolours or minor alterations, while they put serious effort into skins that you can only buy for $20. The content you can unlock by grinding often feels like it only exists to drag you into interfaces that advertise the paid content for you. Even content from the first game, that was originally free, is now paid only.\n\nBattlepass systems suck. \"Pay us for the opportunity to unlock stuff if you play a lot. If you don't you have to pay us more, or lose the stuff you already paid for.\" - Limited time deals, rotating shop offers, FOMO FOMO FOMO... it reeks of manipulation and insincerity.\n\n4. Occasional DLC packs of PvE adventures.\n\nThese are Blizzard's \"new\" approach to PvE. Occasional mission packs where you can get a little bit of story and a PvE mission. You can pay (in my UK currency) £13 for the DLC pack, or £35 (the cost of a good indie game\" for the \"ultimate bundle\".\n\nSo here's the thing - this content is the same amount of content, and the same pace of release as the old mission scenarios - it's just now, instead of them being a free event to get people excited about playing and encourage their friends to join up - now they're paid DLC.\n\nNobody likes paying a regular subscription for a product that they previously owned completely. It doesn't make anyone like Adobe Photoshop or Microsoft Office, and it doesn't make anyone like Blizzard.\n\n-----\n\nSo this is why people are \"review bombing\" your game. You took something we paid for, supported and enjoyed for years, lied to us about your plans, and turned it into trash. Now you're telling us to pay for features and content we previously enjoyed in the game we paid for. It's greedy, it's cynical, it's manipulative, and you've lost our trust.\n\nAlso you should fire Bobby Kotick."
    },
    {
        "user": "KuraiTh3Shad0w",
        "user_ID": "76561199643107170",
        "country": "Private",
        "date": "25-11-2024",
        "review": "great game if you have friends to play with, if not, just don't play"
    },
    {
        "user": "herm",
        "user_ID": "76561199026445947",
        "country": "Private",
        "date": "25-11-2024",
        "review": "It's fast-paced and running around fun fun yes"
    },
    {
        "user": "Monkee99",
        "user_ID": "76561198139197572",
        "country": "Private",
        "date": "25-11-2024",
        "review": "♥♥♥♥ this ♥♥♥♥♥♥ ass game"
    },
    {
        "user": "GoodMorning",
        "user_ID": "76561198438925334",
        "country": "CA",
        "date": "25-11-2024",
        "review": "I have autism"
    },
    {
        "user": "The Rain Witch",
        "user_ID": "Fusfor",
        "country": "Private",
        "date": "25-11-2024",
        "review": "they took away my gambling"
    },
    {
        "user": "JH9rp1",
        "user_ID": "76561199508734626",
        "country": "Private",
        "date": "25-11-2024",
        "review": "is veve god"
    },
    {
        "user": "GehLieberOff_",
        "user_ID": "urlproffil",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Hi"
    },
    {
        "user": "APOCALYPSE",
        "user_ID": "76561198433210478",
        "country": "BA",
        "date": "25-11-2024",
        "review": "started playing cuz of porn"
    },
    {
        "user": "FAUST",
        "user_ID": "hestur",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Played this in beta and all the way to end of the first game (overwatch which we btw paied for...) and then they force free to play all of a sudden and removed the old game - made a sequal (overwatch 2) with only minor changes like the 6-6 became 5-5. Tried that for some time and realized the game was only worse. They also removed the option to obtain lootboxes without paying and even forced removed all unopend exsisting lootboxes you had on your account. ( i had an account with +200 different lootboxes legendary - limited time event boxes ect.)\n\nIf you like trolls and kids who prefere looking at skins during a competitve match instead of playing, this is the game for you!\n\nId play overwatch 1 still if they had made a standalone game instead of making a forced sequal update to the exsisting..."
    },
    {
        "user": "immy",
        "user_ID": "76561199289243004",
        "country": "GB",
        "date": "25-11-2024",
        "review": "If you are feeling suicidal then I would highly recommend this game because playing it will help you take that final step over the ledge. Even if you aren't, this game will change that.\nAnyone wondering whether this game is the game for you? Take a quick look into your brain and take into consideration the mental stability you are currently in. If your life seems to be going good then either remember it because if you play this it will be the last time you ever feel that way."
    },
    {
        "user": "VERY MERRY JERRY",
        "user_ID": "76561198889327447",
        "country": "IM",
        "date": "25-11-2024",
        "review": "Best example of how to ♥♥♥♥ up a game when the devs get obsessed with 'rock scissor paper' counter meta, while the real problem is copy-paste maps.\n\nLow ranking players are forced to play counter picks in order to win(they can't overcome with skill) causing endless pick changes which cuts the momentum of enjoying the game.\nHigh ranking players suffer from playing the same meta comp in most of the maps due to same map design.\n\nSuggestion\n-> Try to add more layers on the map that are responsive to the environment. Just like quake.\nRework or add more versatile heros like Venture, genji, sombra, and winston.\n(same roles but slightly different skill desgin -> making options for the same dive comp)\nEven though both sides are playing dive comp both sides are using different character, this will make the audience\nmore entertained to watch and players won't get board playing the same character in same maps"
    },
    {
        "user": "Luke",
        "user_ID": "76561198836120477",
        "country": "US",
        "date": "25-11-2024",
        "review": "♥♥♥♥ game, I don't know why I still play it."
    },
    {
        "user": "weskers husband",
        "user_ID": "76561199009810146",
        "country": "AU",
        "date": "25-11-2024",
        "review": "no"
    },
    {
        "user": "dos",
        "user_ID": "adldos",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Don't recommend."
    },
    {
        "user": "GroovyCafe",
        "user_ID": "pun_master_64",
        "country": "Private",
        "date": "25-11-2024",
        "review": "It's like a toxic ex, I can't stop coming back..."
    },
    {
        "user": "MacTavish",
        "user_ID": "76561199172148227",
        "country": "IN",
        "date": "25-11-2024",
        "review": "Akdom Magir bacchar moton game bara"
    },
    {
        "user": "Miros",
        "user_ID": "pleasepleasepleasesuckmyballs",
        "country": "Private",
        "date": "25-11-2024",
        "review": "they made it good again. the new guy is good. don't bring back 6v6. i dont want anyone taking the new guy from me"
    },
    {
        "user": "Ibuilder11",
        "user_ID": "76561198981830183",
        "country": "US",
        "date": "25-11-2024",
        "review": "sometimes i go home after a bad day and make it worse by deciding to play overwatch"
    },
    {
        "user": "Nilla",
        "user_ID": "VMNilla",
        "country": "Private",
        "date": "25-11-2024",
        "review": "imagine being that white chick on the couch in the meme, thats going to be you playing this :dexter: :steamhearteyes:"
    },
    {
        "user": "Mr. Bumpy",
        "user_ID": "76561199073395350",
        "country": "US",
        "date": "25-11-2024",
        "review": "God awful ♥♥♥♥♥♥♥ game who would ever play this ♥♥♥♥♥♥♥ scrap of crumbs that is somehow called a game. I'd have better luck if my teammates were a worm than what they always are. If its not my dps only pinching the other teams nipple once the whole game its a teammate leaving and everyone else being forced to play a miserable game where there is no hope of winning and you cant leave because if you do you get banned. Devs come and clean up the game before I came and ransack your humble abode and take everyone you love and have ever cared about including your stiff socks."
    },
    {
        "user": "Gio",
        "user_ID": "76561198796681740",
        "country": "Private",
        "date": "25-11-2024",
        "review": "this game is so bad i cant even put it into words"
    },
    {
        "user": "GodzillaInSpace",
        "user_ID": "76561199412370969",
        "country": "Private",
        "date": "25-11-2024",
        "review": "It's interesting, and I heard recommending gives credits so why not."
    },
    {
        "user": "Moirezy",
        "user_ID": "76561199465723809",
        "country": "Private",
        "date": "25-11-2024",
        "review": "i suck at this game"
    },
    {
        "user": "KMont1234",
        "user_ID": "kmont1234",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Love-hate-hate relationship"
    },
    {
        "user": "Akari",
        "user_ID": "shirasetoshirase",
        "country": "Private",
        "date": "25-11-2024",
        "review": "oh... the corps..."
    },
    {
        "user": "cess",
        "user_ID": "76561198821735444",
        "country": "Private",
        "date": "25-11-2024",
        "review": "my friends said i should try it\n\ni got told to hang myself and that i hate americans apparently\n\naverage gameplay commentary"
    },
    {
        "user": "SaDeAK",
        "user_ID": "76561198959481951",
        "country": "Private",
        "date": "25-11-2024",
        "review": "why me phone number is required to make me play the game?"
    },
    {
        "user": "KOREAN PUTIN",
        "user_ID": "76561198838607894",
        "country": "Private",
        "date": "25-11-2024",
        "review": "uy"
    },
    {
        "user": "barely legal teen",
        "user_ID": "76561198797943603",
        "country": "Private",
        "date": "25-11-2024",
        "review": "winston egirl watch"
    },
    {
        "user": "sixtyblessings",
        "user_ID": "saveyourway",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I'm forced to play this game but it's fun ig"
    },
    {
        "user": "Willyfrost",
        "user_ID": "76561198110468277",
        "country": "Private",
        "date": "25-11-2024",
        "review": "its good but somedays now and then everytime i try aznd play it it wont appear on screen it only appears when i put my cursor on it"
    },
    {
        "user": "dxxznv",
        "user_ID": "76561199550923559",
        "country": "AU",
        "date": "25-11-2024",
        "review": "stop it now"
    },
    {
        "user": "RXVNGE",
        "user_ID": "76561199369296538",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Product received for free\n\nez"
    },
    {
        "user": "ezasway",
        "user_ID": "ezasway",
        "country": "Private",
        "date": "25-11-2024",
        "review": "yes"
    },
    {
        "user": "DominusM",
        "user_ID": "76561199246777829",
        "country": "US",
        "date": "25-11-2024",
        "review": "100 hours exactly... yay..."
    },
    {
        "user": "Pb",
        "user_ID": "Pb179",
        "country": "Private",
        "date": "25-11-2024",
        "review": "They've finally adopted the League of legends character design of \"we've run out of ideas so lets just mash pre-existing abilities together\" Hazard isnt unbeatable, just lame."
    },
    {
        "user": "RiceWithSpice",
        "user_ID": "76561198261937069",
        "country": "US",
        "date": "25-11-2024",
        "review": "Doomfist needs more buffs."
    },
    {
        "user": "Michaelanglioϡ",
        "user_ID": "76561199417169559",
        "country": "US",
        "date": "25-11-2024",
        "review": "this game is decent"
    },
    {
        "user": "s0cksarthitis",
        "user_ID": "76561199374254609",
        "country": "Private",
        "date": "25-11-2024",
        "review": "stuopid ♥♥♥♥♥♥♥ gam i want mauga sexually tho"
    },
    {
        "user": "Smvb64",
        "user_ID": "76561198021992002",
        "country": "CA",
        "date": "25-11-2024",
        "review": "Papa Jeff come back"
    },
    {
        "user": "mr knuck1e head",
        "user_ID": "mr_knuck1e_head",
        "country": "Private",
        "date": "25-11-2024",
        "review": "this game gave me straight ptsd. sombras sneaking up behind you make you flinch harder that a drunk father when he raises his hand."
    },
    {
        "user": "Bero",
        "user_ID": "76561199331355641",
        "country": "Private",
        "date": "25-11-2024",
        "review": "MID"
    },
    {
        "user": "Sandman",
        "user_ID": "76561198074838247",
        "country": "US",
        "date": "25-11-2024",
        "review": "mclovin"
    },
    {
        "user": "boalsees",
        "user_ID": "76561199227314831",
        "country": "KW",
        "date": "25-11-2024",
        "review": "ez"
    },
    {
        "user": "RoboticStump",
        "user_ID": "76561198008646007",
        "country": "US",
        "date": "25-11-2024",
        "review": "."
    },
    {
        "user": "imnotgood",
        "user_ID": "76561199773725588",
        "country": "Private",
        "date": "25-11-2024",
        "review": "bad"
    },
    {
        "user": "Parsi2",
        "user_ID": "76561198973651726",
        "country": "US",
        "date": "25-11-2024",
        "review": "Great game, bad company"
    },
    {
        "user": "Nazareth",
        "user_ID": "76561199124192476",
        "country": "US",
        "date": "25-11-2024",
        "review": "gonna lie here and say this game is fun"
    },
    {
        "user": "cianburnett19",
        "user_ID": "76561199797287800",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Product received for free\n\nI have been married 2 times n now divorced twice all because of this game, my dad died and i missed his funeral and missed the birth of my 2 kids. this game is highly addictive and i only recommend it to no lifes that bottom feed off their parents. LIKE ME!!!!!!!!!!!!"
    },
    {
        "user": "Sweat wannabe",
        "user_ID": "76561199542399038",
        "country": "IQ",
        "date": "25-11-2024",
        "review": "Not bad, I have spent around 45 minutes completing captcha-s and email + sms verifications\nTrying to log into an already existing account is a quick time event:\n- you get code, a link you cannot copy, and a QR code that doesn't work\n- the code expires in 14 minutes, you have to restart the captchas if you run out of time\n- when you try to log in, each time you have to fill an increasing number of captchas (my pb is 10)\n- the captcha has an increasing number of images, with dices on them which you have to sum up and try to find the one image that shows the amount required\n- if you just fail one, you start over\n- when you pass this part, there is 10% chance it doesn't show a random error\n- in case it works, you need to either confirm with email or sms (tried both, sms is less boring)\n- at this point you have a 20% chance that you get \"Accept terms of service\" page, otherwise you are logged out and start again\n- if you manage to accept that, you can play the game\n\nTime to beat: 45 minutes GLHF\n\nAlso, there is some kind of shooter game after this part, I do not recommend that one."
    },
    {
        "user": "void",
        "user_ID": "76561199437866241",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Not bad"
    },
    {
        "user": "obi",
        "user_ID": "76561199100338679",
        "country": "US",
        "date": "25-11-2024",
        "review": "hevent spent a dime on this game and i still want my money back"
    },
    {
        "user": "nicc.man",
        "user_ID": "niccdotman",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I still play overwatch but they fumbled this game HARD"
    },
    {
        "user": "Baka.abdi",
        "user_ID": "76561199511498823",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Product received for free\n\nIt's a really cool game but some players are toxic so remember to be nice and have fun"
    },
    {
        "user": "Niko",
        "user_ID": "Nikosakaniko",
        "country": "Private",
        "date": "25-11-2024",
        "review": "I cannot believe i actually like this game what the hell"
    },
    {
        "user": "topphantom007",
        "user_ID": "topphantom007",
        "country": "Private",
        "date": "25-11-2024",
        "review": "very fun"
    },
    {
        "user": "Warpth",
        "user_ID": "76561199618938112",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Marvel rivals better"
    },
    {
        "user": "Ovey",
        "user_ID": "Ovey",
        "country": "Private",
        "date": "25-11-2024",
        "review": "2/10\n\nOne point for each of Mercy's Boobas :)"
    },
    {
        "user": "Marie The Bae uwu~",
        "user_ID": "Toaster-Troll",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Played a thousand hours on the old version and I regretted it then."
    },
    {
        "user": "PiggyPooBallz",
        "user_ID": "HeavenSentInk",
        "country": "Private",
        "date": "25-11-2024",
        "review": "one of the greatest shooters of all time. it's not completely garbage now but there's been a lot of questionable decisions done with the game over the years, y'know typical \"muh corporate greed\" kinda stuff, s/o activision"
    },
    {
        "user": "Rockdrill",
        "user_ID": "76561199175775623",
        "country": "Private",
        "date": "25-11-2024",
        "review": "This game is good if you like torturing yourself and destroying your mental state\nalso if you have poor financial decisions you'd love this"
    },
    {
        "user": "SweatyDon03",
        "user_ID": "76561199056985650",
        "country": "Private",
        "date": "25-11-2024",
        "review": "Fix your game"
    },
    {
        "user": "Jim \"Slayer of Crawdad\" Muggins",
        "user_ID": "76561199095753053",
        "country": "US",
        "date": "25-11-2024",
        "review": "Hey, if you are thinking about getting into Overwatch, just wait for Marvel Rivals and give that a try instead.\nIt'll save you a LOT of pain,"
    },
    {
        "user": "Joker",
        "user_ID": "76561199137227772",
        "country": "Private",
        "date": "25-11-2024",
        "review": "found a gamebreaking bug that this still exists on steam"
    },
    {
        "user": "redout",
        "user_ID": "76561199153428002",
        "country": "Private",
        "date": "25-11-2024",
        "review": "never play this god awful hellhole disguising itself as a game"
    },
    {
        "user": "Fayil",
        "user_ID": "76561198053575922",
        "country": "Private",
        "date": "25-11-2024",
        "review": "It's a bit Toxic"
    },
    {
        "user": "A4Craft",
        "user_ID": "A4Craft",
        "country": "Private",
        "date": "25-11-2024",
        "review": "getting pushed into a match and its already finished thanks game\n\nokay back to ow"
    },
    {
        "user": "judef11",
        "user_ID": "76561199466282966",
        "country": "GB",
        "date": "24-11-2024",
        "review": "Its overwatch"
    },
    {
        "user": "PapiExplosivo",
        "user_ID": "76561198116531487",
        "country": "CA",
        "date": "24-11-2024",
        "review": "♥♥♥♥ game"
    },
    {
        "user": "2A",
        "user_ID": "4Y2A",
        "country": "Private",
        "date": "24-11-2024",
        "review": "ex top 500 dps here,\n\nnew gen overwatch porn is ass there i said it O-O\nold gen overwatch porn was peak >-<"
    },
    {
        "user": "kozemach",
        "user_ID": "76561198375832881",
        "country": "US",
        "date": "24-11-2024",
        "review": "is fun with good team otherwise meh"
    },
    {
        "user": "dragonrykr2",
        "user_ID": "dragonrykr",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Honestly, I'm having a blast. I never played any iteration of Overwatch before. A friend taught me how to play and it's super fun!"
    },
    {
        "user": "BIG_Crime",
        "user_ID": "76561199043604997",
        "country": "Private",
        "date": "24-11-2024",
        "review": "camos"
    },
    {
        "user": "toy0tta",
        "user_ID": "76561198396295411",
        "country": "GR",
        "date": "24-11-2024",
        "review": "dont"
    },
    {
        "user": "ham stroker's ejacula",
        "user_ID": "yomamafan72",
        "country": "Private",
        "date": "24-11-2024",
        "review": "this game so ass"
    },
    {
        "user": "ttv//Rosomnia",
        "user_ID": "rosomnia",
        "country": "Private",
        "date": "24-11-2024",
        "review": "bad game but i keep playing >:("
    },
    {
        "user": "sincoberry",
        "user_ID": "sincoberry",
        "country": "Private",
        "date": "24-11-2024",
        "review": "game is absolutely nothing like what it used to be"
    },
    {
        "user": "i like my cheese drippy bruh",
        "user_ID": "76561198892858795",
        "country": "US",
        "date": "24-11-2024",
        "review": "its got PHAT assas"
    },
    {
        "user": "Heck",
        "user_ID": "76561198246646576",
        "country": "US",
        "date": "24-11-2024",
        "review": "Where lootbox"
    },
    {
        "user": "Envicity",
        "user_ID": "76561198975515807",
        "country": "Private",
        "date": "24-11-2024",
        "review": "this game is complete and utter ♥♥♥♥♥♥♥ and should never have a single player on it at any point and or time"
    },
    {
        "user": "ズビー",
        "user_ID": "76561199084519642",
        "country": "GB",
        "date": "24-11-2024",
        "review": "this game gave me stage 5 cancer"
    },
    {
        "user": "They Have My Daughter",
        "user_ID": "76561197979532141",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Making me create a battle net account and then setting up an SMS to protect the account I didn't want....brainless. Deserves to fail off that alone."
    },
    {
        "user": "ₛₚₗᵧₚₕ",
        "user_ID": "76561198268807595",
        "country": "CA",
        "date": "24-11-2024",
        "review": "People are salty.\nAs a (relatively) new player this is one of the best games I've ever played. Mind you you will have about 1/2hrs on any given character where you feel lost but after that its so fun."
    },
    {
        "user": "Where is my son?",
        "user_ID": "76561198811171534",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Mauga"
    },
    {
        "user": "XerTz",
        "user_ID": "76561198408129696",
        "country": "Private",
        "date": "24-11-2024",
        "review": "DONT DO IT, I KNOW YOUR THINKING ABOUT PLAYING. DONT ♥♥♥♥♥♥♥ DO IT, SAVE YOURSELF"
    },
    {
        "user": "wumussy",
        "user_ID": "76561199277120610",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Product received for free\n\nOne of Overwatch's defining features is its emphasis on teamwork, yet this is also its most glaring flaw. The game is so reliant on coordinated play that a single uncooperative or underperforming teammate can sabotage an entire match. For solo queue players, the experience is often a gamble; you might land in a competent team or endure a lopsided defeat due to lack of synergy. The frustration compounds when losing feels out of your control, undermining the enjoyment of personal skill improvement.Additionally, balancing issues plague the game. Blizzard frequently reworks heroes and implements patches that either over-buff or nerf characters, creating a volatile meta. As a result, players are often forced to abandon their preferred heroes to adapt to ever-shifting trends. This cycle alienates casual gamers who simply want to enjoy their favorite characters without being penalized by the game's competitive environment.Another significant drawback is the Overwatch community. Toxicity, whether in the form of verbal abuse, trolling, or throwing matches, is a pervasive issue. While competitive games often foster heated environments, Overwatch's heavy reliance on team coordination exacerbates this problem. When a match goes poorly, blame is often hurled indiscriminately, creating a hostile atmosphere.\n\nThe problem extends to the wider community, where gatekeeping and elitism are not uncommon. New players might struggle to feel welcomed as seasoned players criticize their mistakes or dismiss them outright. Overwatch's community dynamics often make it difficult to enjoy the game as a newcomer or casual player.Blizzard Entertainment's handling of Overwatch also leaves much to be desired. Their monetization strategies, particularly with the introduction of Overwatch 2, sparked widespread criticism. The switch to a free-to-play model accompanied by aggressive microtransactions and battle passes alienated many loyal fans. Where Overwatch 1 offered all heroes and maps upfront for a one-time purchase, Overwatch 2 locked much of its content behind paywalls or grind-heavy challenges, fostering a sense of exploitation among players.Moreover, the promised PvE mode in Overwatch 2—a major selling point for its sequel—was significantly scaled back after years of anticipation. This move felt like a betrayal to fans who had been eagerly awaiting a more robust single-player or cooperative experience. Such decisions not only tarnish the game but also diminish trust in Blizzard as a developer.While Overwatch’s gameplay was revolutionary at launch, its core mechanics have grown repetitive over the years. Despite the addition of new heroes, maps, and modes, the fundamental experience remains largely unchanged. For players who have been with the game since its early days, the lack of meaningful innovation makes the game feel stagnant.\n\nThe constant grind for competitive rank, combined with the repetitive nature of quick play and arcade modes, often leads to burnout. This monotony is further aggravated by the game's matchmaking system, which frequently pits players against significantly stronger or weaker opponents, resulting in either crushing defeats or hollow victories. Overwatch’s potential as a groundbreaking team-based shooter is undeniable, but its execution leaves much to be desired. The game’s reliance on teamwork, volatile balancing, and community toxicity often make it more stressful than enjoyable. Add to this Blizzard's controversial decisions and a stale gameplay loop, and it becomes clear why many players, myself included, have grown to dislike the game. While Overwatch may still hold appeal for some, its flaws overshadow its merits, making it a frustrating experience for those seeking consistent enjoyment."
    },
    {
        "user": "Tricks",
        "user_ID": "76561198818168753",
        "country": "US",
        "date": "24-11-2024",
        "review": "ew"
    },
    {
        "user": "Greba Thumberg Feet",
        "user_ID": "76561197998075521",
        "country": "US",
        "date": "24-11-2024",
        "review": "Game balance is all f'd up."
    },
    {
        "user": "xzentalz",
        "user_ID": "76561199729067231",
        "country": "Private",
        "date": "24-11-2024",
        "review": "i like the game, you dont have to though :)"
    },
    {
        "user": "666sad",
        "user_ID": "sadanddiddypressed",
        "country": "Private",
        "date": "24-11-2024",
        "review": "This might be the words game to have been ever released if you plan on playing this game go download marvel rivals this game so azz"
    },
    {
        "user": "quackers46.ttv",
        "user_ID": "76561198042491891",
        "country": "Private",
        "date": "24-11-2024",
        "review": "i say try it because most of the negative reviews are mad about the release of this game, but this game sucks because it takes too long to learn a character or they are just too hard to play so yeah game sucks"
    },
    {
        "user": "Sun on the beach",
        "user_ID": "76561198025277780",
        "country": "Private",
        "date": "24-11-2024",
        "review": "-"
    },
    {
        "user": "xLiachux",
        "user_ID": "76561199507183449",
        "country": "Private",
        "date": "24-11-2024",
        "review": "falsely banned my friend, stupid devs"
    },
    {
        "user": "billsjason34",
        "user_ID": "76561199785822862",
        "country": "Private",
        "date": "24-11-2024",
        "review": "this game is by far one of the best ive played so i highly reccomend this game to anyone who is looking for a fun shooter game"
    },
    {
        "user": "CaptainShiba_261",
        "user_ID": "CaptainShiba261",
        "country": "Private",
        "date": "24-11-2024",
        "review": "I like killing people"
    },
    {
        "user": "Babyersej",
        "user_ID": "76561199016170629",
        "country": "DK",
        "date": "24-11-2024",
        "review": "♥♥♥♥♥"
    },
    {
        "user": "Dog Boy",
        "user_ID": "76561199588878150",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Product received for free\n\nit's overwatch 2 no explenation needed"
    },
    {
        "user": "Baggs",
        "user_ID": "76561199111914782",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Save yourself"
    },
    {
        "user": "<c=FF0000FF>Delion X'ian </c>",
        "user_ID": "76561198282909383",
        "country": "Private",
        "date": "24-11-2024",
        "review": "1. why the ♥♥♥♥ would you need A PHONE NUMBER to \"ptotect account\" FOR FREE ♥♥♥♥♥♥♥ GAME\n2. Oh yeah, of course battle net is ♥♥♥♥♥♥♥ retarded with its location settings and bless you if you dont have vpn when first registering\n3. i sitted 6 hours awaiting support from battle net to link a ♥♥♥♥♥♥♥ phone"
    },
    {
        "user": "Mefisio",
        "user_ID": "76561199797662690",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Ill be honest...I've been playing this game since season 2....i climbed out of bronze up to low platinum....this game is hecka fun when your team is competent....i try to blow off steam...video games are my escape from an annoying life...BECAUSE IM GOOD AT THEM! but it doesnt effing matter in this game because every teammate you get when you create a new account DOES NOT GIVE HALF A DAMN...they throw and cannot even get out of spawn....SO IM NEVER GOING TO QUALIFY FOR COMP AND NEVER HAVE GOOD TEAMMATES...ITS EVERY EFFING GAME the enemy team is ABSOLUTELY giving it a try and STOMPING and i just get these losers who sit there and let them win...WHAT THE EFF ARE YOU THINKING ?! MAKING IT A PENALTY TO LEAVE WHEN THEY DONT GIVE A FLYING F?! IM SO EFFING PISSED BECAUSE IVE BEEN NOTHING BUT A LOYAL PLAYER OF THIS GAME BECAUSE WHEN IT WORKS ITS FUN BUT ANYMORE NOBODY CARES?!"
    },
    {
        "user": "Zakuska_Boroda",
        "user_ID": "76561198397408708",
        "country": "US",
        "date": "24-11-2024",
        "review": "This game just sucks"
    },
    {
        "user": "i cried over an animated tv show",
        "user_ID": "76561199467200450",
        "country": "GB",
        "date": "24-11-2024",
        "review": "Made me beat my wife 10/10 would noy recomend finna kms now"
    },
    {
        "user": "nothin",
        "user_ID": "76561199199596619",
        "country": "Private",
        "date": "24-11-2024",
        "review": "carrying my ass teammates with 500 hours bro this game is dog"
    },
    {
        "user": "nyrv",
        "user_ID": "76561199790851184",
        "country": "Private",
        "date": "24-11-2024",
        "review": "i dont like anything about this game"
    },
    {
        "user": "Bonk Boy",
        "user_ID": "76561199586167763",
        "country": "US",
        "date": "24-11-2024",
        "review": "I've threatened many people on this game along with my girlfriend, 10/10, great for stalking"
    },
    {
        "user": "Kuro",
        "user_ID": "76561199157790130",
        "country": "Private",
        "date": "24-11-2024",
        "review": "good game"
    },
    {
        "user": "ChristophLHR",
        "user_ID": "76561198049622723",
        "country": "DE",
        "date": "24-11-2024",
        "review": "look what they are doing to my boy"
    },
    {
        "user": "NinjaRaceBoy",
        "user_ID": "76561199078545692",
        "country": "CA",
        "date": "24-11-2024",
        "review": "i hate this game"
    },
    {
        "user": "bvang08",
        "user_ID": "76561199434521032",
        "country": "Private",
        "date": "24-11-2024",
        "review": "I hate but im adicted"
    },
    {
        "user": "Cajan",
        "user_ID": "cajanplaysgames",
        "country": "Private",
        "date": "24-11-2024",
        "review": "fun sometimes"
    },
    {
        "user": "KSHCKLD",
        "user_ID": "76561198968698708",
        "country": "BD",
        "date": "24-11-2024",
        "review": "just go watch the porn"
    },
    {
        "user": "pretty",
        "user_ID": "76561199467236007",
        "country": "Private",
        "date": "24-11-2024",
        "review": "fun lol"
    },
    {
        "user": "Sni9er",
        "user_ID": "Sni9er",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Came back recently for Overwatch Classic with my friends, long may it stay !!!"
    },
    {
        "user": "Tali",
        "user_ID": "76561198048943249",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Game itself? Meh, not what we were promised but not bad either.\n\nThe players however? Have got to be among some of the most brain dead specimen I've ever had the displeasure of teaming with."
    },
    {
        "user": "Orion118",
        "user_ID": "76561198160128989",
        "country": "GB",
        "date": "24-11-2024",
        "review": "Download this god forsaken garbage, let it consume your life"
    },
    {
        "user": "Birky",
        "user_ID": "76561198380519355",
        "country": "US",
        "date": "24-11-2024",
        "review": "Overwatch"
    },
    {
        "user": "Mafidella",
        "user_ID": "Mafidella",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Who could've thought R 34 would be this good?? Insane gameplay, the story is phenomenal, and I don't think i'd ever play any other game again!"
    },
    {
        "user": "jamarius",
        "user_ID": "76561198871252977",
        "country": "GB",
        "date": "24-11-2024",
        "review": "♥♥♥♥ game, about 14 monitors destroyed and needs a welsh character to make it better - 100000000000000000000000"
    },
    {
        "user": "mauga otp",
        "user_ID": "maugaotp",
        "country": "Private",
        "date": "24-11-2024",
        "review": "IT'S ♥♥♥♥♥♥ ♥♥♥♥ LIKE MUN"
    },
    {
        "user": "Prince",
        "user_ID": "76561199065148272",
        "country": "IN",
        "date": "24-11-2024",
        "review": "lund game bc na aim hota hai mera sa na bc koi heal deta hai lund game bhai 🥲"
    },
    {
        "user": "Puppy Girl Vee",
        "user_ID": "76561198357813230",
        "country": "IE",
        "date": "24-11-2024",
        "review": "used to be good but now its ass :3"
    },
    {
        "user": "Spectzie",
        "user_ID": "76561199793535797",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Product received for free\n\now1 was better"
    },
    {
        "user": "deadweight",
        "user_ID": "Life_Is_Not_Daijoubu",
        "country": "Private",
        "date": "24-11-2024",
        "review": "nah"
    },
    {
        "user": "jaxky_",
        "user_ID": "76561198070611780",
        "country": "GB",
        "date": "24-11-2024",
        "review": "i logged on after maybe a year of not playing and my 2 gold guns that i had from hours and hours of playing were gone. 10/10 game"
    },
    {
        "user": "kiransymonds100",
        "user_ID": "76561199754655045",
        "country": "Private",
        "date": "24-11-2024",
        "review": "very good"
    },
    {
        "user": "mrhdsye",
        "user_ID": "76561199077142247",
        "country": "Private",
        "date": "24-11-2024",
        "review": "btguyhjgnhbvknhjkhjguyhjgvfgtyhujikjuhgfgrytuijhgthyuju7kyihbgnty7689iuyhjggfrtyuyihjgbvcgftyruyikjmnbvhgfyhtuikjmnbghuytikjhgbghytuiokjnbvghytui8uojk"
    },
    {
        "user": "no'am",
        "user_ID": "76561199002211056",
        "country": "Private",
        "date": "24-11-2024",
        "review": "fun game but blizzard sucks"
    },
    {
        "user": "Luther-ANDROID",
        "user_ID": "76561199041159301",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Don't play Overwatch classic\nbut Overwatch 2 is good with friends"
    },
    {
        "user": "Nixon",
        "user_ID": "iLvNixon",
        "country": "Private",
        "date": "24-11-2024",
        "review": "very poor game"
    },
    {
        "user": "NukeSanity",
        "user_ID": "NukeSanity",
        "country": "Private",
        "date": "24-11-2024",
        "review": "They promised to sell an exclusive skin.\n\nWhat happens? They literally sold it again.\n\nDisgusting, scummy, and predatory business practices.\n\nBe aware of this whenever you play this game. Play for free if you wish, but don't give them a cent."
    },
    {
        "user": "draino",
        "user_ID": "76561199259288586",
        "country": "TD",
        "date": "24-11-2024",
        "review": "💩💩💩💩💩💩💩💩💩💩"
    },
    {
        "user": "ZONE",
        "user_ID": "76561198980402475",
        "country": "Private",
        "date": "24-11-2024",
        "review": "decent"
    },
    {
        "user": "Igor's Owner",
        "user_ID": "76561198282544949",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Au copiat Paladins L+Not epic+bruh"
    },
    {
        "user": "BK-201",
        "user_ID": "76561198244770782",
        "country": "JO",
        "date": "24-11-2024",
        "review": "Awful"
    },
    {
        "user": "tiffanyburton967",
        "user_ID": "76561199738917432",
        "country": "US",
        "date": "24-11-2024",
        "review": "thhgdggfghgmhbvgdhkj"
    },
    {
        "user": "callumvandenn",
        "user_ID": "76561199066422350",
        "country": "Private",
        "date": "24-11-2024",
        "review": ">:("
    },
    {
        "user": "Fires",
        "user_ID": "LordFires",
        "country": "Private",
        "date": "24-11-2024",
        "review": "You know a game is really botched when they bring back the OG version lmao"
    },
    {
        "user": "Titan0fTech",
        "user_ID": "Titan0fTech",
        "country": "Private",
        "date": "24-11-2024",
        "review": "I enjoy the game but I'm going to down vote because of peer pressure."
    },
    {
        "user": "cacashibo Miałki",
        "user_ID": "76561199073965150",
        "country": "Private",
        "date": "24-11-2024",
        "review": "game will let people spinbot for months but ban people for saying \"hardcore meth\""
    },
    {
        "user": "farmacyst",
        "user_ID": "76561198088586744",
        "country": "IN",
        "date": "24-11-2024",
        "review": "The graphics are so smooth, there is no server side lag. Overall amazing game\n\nDislikes:\nThe skill based matching sucks, majority of the time, you get opponents way above your skills which can sometimes ruin your experience"
    },
    {
        "user": "P DIDDY",
        "user_ID": "76561199050428751",
        "country": "IN",
        "date": "24-11-2024",
        "review": "skibidi"
    },
    {
        "user": "DespairForLife",
        "user_ID": "76561199198282371",
        "country": "Private",
        "date": "24-11-2024",
        "review": "I don't see a fps with this many feature or cheaters. But it's fun atleast"
    },
    {
        "user": "dyl",
        "user_ID": "high-vortex",
        "country": "Private",
        "date": "24-11-2024",
        "review": "SUPER AWESOME FUN GAME! I'VE NEVER PLAYED ANYTHING LIKE IT BEFORE! HIGHLY RECOMMEND!"
    },
    {
        "user": "JDash",
        "user_ID": "76561198177753013",
        "country": "CA",
        "date": "24-11-2024",
        "review": "downloaded the game just to call it bad"
    },
    {
        "user": "CholosFoo",
        "user_ID": "Cholofoocuh",
        "country": "Private",
        "date": "24-11-2024",
        "review": "I ♥♥♥♥♥♥♥ hate this game"
    },
    {
        "user": "Ex",
        "user_ID": "76561199075706225",
        "country": "Private",
        "date": "24-11-2024",
        "review": "It will consume you DONT!!!!"
    },
    {
        "user": "Ur Sofa",
        "user_ID": "76561198856097255",
        "country": "Private",
        "date": "24-11-2024",
        "review": "this ♥♥♥♥ gas"
    },
    {
        "user": "LEPOOKIE",
        "user_ID": "76561199154835777",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Product received for free\n\nthis game is ♥♥♥♥. ♥♥♥♥ company. ♥♥♥♥ game. ♥♥♥♥ blizzard."
    },
    {
        "user": "Mao's Kitten",
        "user_ID": "76561199772782099",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Change your ♥♥♥♥♥♥♥ report system. Keep getting false silenced for no reason, no wonder no one likes this ♥♥♥♥♥♥♥ game. I have got people who says n word and not getting silenced in my friend list. I got silenced, suspended, silenced again. this is ♥♥♥♥♥♥♥♥."
    },
    {
        "user": "CosmodeusVEVO",
        "user_ID": "76561199172237459",
        "country": "US",
        "date": "24-11-2024",
        "review": "It's not as great as the Original Overwatch, but despite Blizzard's Poor Management, Numerous Predatory Microtransactions, and the cancellation of a lot of the PVE Content, Overwatch 2 is still pretty fun if your looking for something to play, as long as you dont lose your temper against constant deaths by the enemy widow or get pestered by aggravated/tryhard teammates"
    },
    {
        "user": "ItsJolt",
        "user_ID": "itsjolt",
        "country": "Private",
        "date": "24-11-2024",
        "review": "dont play it"
    },
    {
        "user": "foxfoxfoxfoxfoxfoxfoxfoxfoxfox",
        "user_ID": "76561198994321730",
        "country": "US",
        "date": "24-11-2024",
        "review": "bleh!"
    },
    {
        "user": "MythicTurtle",
        "user_ID": "123823",
        "country": "Private",
        "date": "24-11-2024",
        "review": "In Congress, July 4, 1776\n\nThe unanimous Declaration of the thirteen united States of America, When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.\n\nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.--That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness. Prudence, indeed, will dictate that Governments long established should not be changed for light and transient causes; and accordingly all experience hath shewn, that mankind are more disposed to suffer, while evils are sufferable, than to right themselves by abolishing the forms to which they are accustomed. But when a long train of abuses and usurpations, pursuing invariably the same Object evinces a design to reduce them under absolute Despotism, it is their right, it is their duty, to throw off such Government, and to provide new Guards for their future security.--Such has been the patient sufferance of these Colonies; and such is now the necessity which constrains them to alter their former Systems of Government. The history of the present King of Great Britain is a history of repeated injuries and usurpations, all having in direct object the establishment of an absolute Tyranny over these States. To prove this, let Facts be submitted to a candid world.\n\nHe has refused his Assent to Laws, the most wholesome and necessary for the public good.\n\nHe has forbidden his Governors to pass Laws of immediate and pressing importance, unless suspended in their operation till his Assent should be obtained; and when so suspended, he has utterly neglected to attend to them.\n\nHe has refused to pass other Laws for the accommodation of large districts of people, unless those people would relinquish the right of Representation in the Legislature, a right inestimable to them and formidable to tyrants only.\n\nHe has called together legislative bodies at places unusual, uncomfortable, and distant from the depository of their public Records, for the sole purpose of fatiguing them into compliance with his measures.\n\nHe has dissolved Representative Houses repeatedly, for opposing with manly firmness his invasions on the rights of the people.\n\nHe has refused for a long time, after such dissolutions, to cause others to be elected; whereby the Legislative powers, incapable of Annihilation, have returned to the People at large for their exercise; the State remaining in the mean time exposed to all the dangers of invasion from without, and convulsions within.\n\nHe has endeavoured to prevent the population of these States; for that purpose obstructing the Laws for Naturalization of Foreigners; refusing to pass others to encourage their migrations hither, and raising the conditions of new Appropriations of Lands.\n\nHe has obstructed the Administration of Justice, by refusing his Assent to Laws for establishing Judiciary powers.\n\nHe has made Judges dependent on his Will alone, for the tenure of their offices, and the amount and payment of their salaries.\n\nHe has erected a multitude of New Offices, and sent hither swarms of Officers to harrass our people, and eat out their substance.\n\nHe has kept among us, in times of peace, Standing Armies without the Consent of our legislatures.\n\nHe has affected to render the Military independent of and superior to the Civil power.\n\nHe has combined with others to subject us to a jurisdiction foreign to our constitution, and unacknowledged by our laws; giving his Assent to their Acts of pretended Legislation:\n\nFor Quartering large bodies of armed troops among us:\n\nFor protecting them, by a mock Trial, from punishment for any Murders which they should commit on the Inhabitants of these States:\n\nFor cutting off our Trade with all parts of the world:\n\nFor imposing Taxes on us without our Consent:\n\nFor depriving us in many cases, of the benefits of Trial by Jury:\n\nFor transporting us beyond Seas to be tried for pretended offences:\n\nFor abolishing the free System of English Laws in a neighbouring Province, establishing therein an Arbitrary government, and enlarging its Boundaries so as to render it at once an example and fit instrument for introducing the same absolute rule into these Colonies:\n\nFor taking away our Charters, abolishing our most valuable Laws, and altering fundamentally the Forms of our Governments:\n\nFor suspending our own Legislatures, and declaring themselves invested with power to legislate for us in all cases whatsoever.\n\nHe has abdicated Government here, by declaring us out of his Protection and waging War against us.\n\nHe has plundered our seas, ravaged our Coasts, burnt our towns, and destroyed the lives of our people.\n\nHe is at this time transporting large Armies of foreign Mercenaries to compleat the works of death, desolation and tyranny, already begun with circumstances of Cruelty & perfidy scarcely paralleled in the most barbarous ages, and totally unworthy the Head of a civilized nation.\n\nHe has constrained our fellow Citizens taken Captive on the high Seas to bear Arms against their Country, to become the executioners of their friends and Brethren, or to fall themselves by their Hands.\n\nHe has excited domestic insurrections amongst us, and has endeavoured to bring on the inhabitants of our frontiers, the merciless Indian Savages, whose known rule of warfare, is an undistinguished destruction of all ages, sexes and conditions.\n\nIn every stage of these Oppressions We have Petitioned for Redress in the most humble terms: Our repeated Petitions have been answered only by repeated injury. A Prince whose character is thus marked by every act which may define a Tyrant, is unfit to be the ruler of a free people.\n\nNor have We been wanting in attentions to our Brittish brethren. We have warned them from time to time of attempts by their legislature to extend an unwarrantable jurisdiction over us. We have reminded them of the circumstances of our emigration and settlement here. We have appealed to their native justice and magnanimity, and we have conjured them by the ties of our common kindred to disavow these usurpations, which, would inevitably interrupt our connections and correspondence. They too have been deaf to the voice of justice and of consanguinity. We must, therefore, acquiesce in the necessity, which denounces our Separation, and hold them, as we hold the rest of mankind, Enemies in War, in Peace Friends.\n\nWe, therefore, the Representatives of the united States of America, in General Congress, Assembled, appealing to the Supreme Judge of the world for the rectitude of our intentions, do, in the Name, and by Authority of the good People of these Colonies, solemnly publish and declare, That these United Colonies are, and of Right ought to be Free and Independent States; that they are Absolved from all Allegiance to the British Crown, and that all political connection between them and the State of Great Britain, is and ought to be totally dissolved; and that as Free and Independent States, they have full Power to levy War, conclude Peace, contract Alliances, establish Commerce, and to do all other Acts and Things which Independent States may of right do."
    },
    {
        "user": "TheDarkAngel",
        "user_ID": "76561199131757145",
        "country": "Private",
        "date": "24-11-2024",
        "review": "A thousand promises, none of witch were delivered on"
    },
    {
        "user": "ZX",
        "user_ID": "76561199086113188",
        "country": "Private",
        "date": "24-11-2024",
        "review": "i hate this game"
    },
    {
        "user": "Hodain",
        "user_ID": "nitrox945",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Very different from OW1 but fun to play still. All heroes are free now btw"
    },
    {
        "user": "rivers",
        "user_ID": "Sqewree",
        "country": "Private",
        "date": "24-11-2024",
        "review": "i love this game\nwouldn't recommend it to others though stay safe"
    },
    {
        "user": "Aguy711",
        "user_ID": "76561198814769476",
        "country": "Private",
        "date": "24-11-2024",
        "review": "0/10 I am NEVER giving you my phone number. ♥♥♥♥ YOU!"
    },
    {
        "user": "Remiss",
        "user_ID": "76561199121884725",
        "country": "US",
        "date": "24-11-2024",
        "review": "Please don't play this, it's not worth the suffering"
    },
    {
        "user": "EvilFrootLoop",
        "user_ID": "76561199209676568",
        "country": "Private",
        "date": "24-11-2024",
        "review": ":("
    },
    {
        "user": "CoffeeKitsune",
        "user_ID": "76561199229341753",
        "country": "US",
        "date": "24-11-2024",
        "review": "Its overwatch"
    },
    {
        "user": "sheikadow",
        "user_ID": "76561198310848092",
        "country": "CA",
        "date": "24-11-2024",
        "review": "idk i have like 1000 hrs in this game"
    },
    {
        "user": "YaeLLowZhang",
        "user_ID": "76561199091944755",
        "country": "Private",
        "date": "24-11-2024",
        "review": "yay"
    },
    {
        "user": "vqr55",
        "user_ID": "76561199471129698",
        "country": "Private",
        "date": "24-11-2024",
        "review": "SO FUN"
    },
    {
        "user": "Hit",
        "user_ID": "HitFirst",
        "country": "Private",
        "date": "24-11-2024",
        "review": "its the biggest piece of d..."
    },
    {
        "user": "Elink15",
        "user_ID": "76561199237600631",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Product received for free\n\none of the best games ive ever played"
    },
    {
        "user": "P33Goblin",
        "user_ID": "76561199594118469",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Doom fist is sexy fr. Anyone wanna disagree?"
    },
    {
        "user": "samsaint",
        "user_ID": "76561199240045602",
        "country": "US",
        "date": "24-11-2024",
        "review": "this game is so good trust me guys, it taught me how to not shoot myself with a gun"
    },
    {
        "user": "Enderjo",
        "user_ID": "76561198138831355",
        "country": "US",
        "date": "24-11-2024",
        "review": "Man i cant stop playing this game"
    },
    {
        "user": "BETTΛEFOX",
        "user_ID": "76561198068421127",
        "country": "US",
        "date": "24-11-2024",
        "review": "Would not reccomend at all, I hate this ♥♥♥♥♥♥♥ game, it makes me want to kill myself. The Devs are the most undervalued part of it due to their lack of care on who gets banned or suspended. They care more about people who say bad things over hackers also known to be one of the games with the least expensive anti cheat. Have fun if you want to actively be slitting your wrists at night..."
    },
    {
        "user": "LegxcyChu",
        "user_ID": "LegxcyChu",
        "country": "Private",
        "date": "24-11-2024",
        "review": "someone called me a ♥♥♥♥♥♥"
    },
    {
        "user": "DINO_NUGGIES123",
        "user_ID": "qweAv123v",
        "country": "Private",
        "date": "24-11-2024",
        "review": "im going to kms"
    },
    {
        "user": "carrotman57",
        "user_ID": "76561199181101485",
        "country": "Private",
        "date": "24-11-2024",
        "review": "♥♥♥♥ game"
    },
    {
        "user": "CACHUMBADO",
        "user_ID": "76561198958086445",
        "country": "JM",
        "date": "24-11-2024",
        "review": "Product received for free\n\nVERY BACANA, MESMO FALIDO É VERY BACANA"
    },
    {
        "user": "Iwak",
        "user_ID": "Iwak9029",
        "country": "Private",
        "date": "24-11-2024",
        "review": "This game killed Overwatch 1."
    },
    {
        "user": "BajiFUM",
        "user_ID": "BajiFUM",
        "country": "Private",
        "date": "24-11-2024",
        "review": "saw dva in p.h that why i started to play but no i might be an addict"
    },
    {
        "user": "dragoose",
        "user_ID": "76561199164624261",
        "country": "Private",
        "date": "24-11-2024",
        "review": "my friend is addicted to this game and hates all other games now"
    },
    {
        "user": "Mash",
        "user_ID": "76561199559099100",
        "country": "Private",
        "date": "24-11-2024",
        "review": "good"
    },
    {
        "user": "MyCatNugget",
        "user_ID": "Catfogtaco183421",
        "country": "Private",
        "date": "24-11-2024",
        "review": "no"
    },
    {
        "user": "CosmixsBrownies",
        "user_ID": "76561199453700507",
        "country": "US",
        "date": "24-11-2024",
        "review": "bad bad"
    },
    {
        "user": "TheAdvisor",
        "user_ID": "76561199524125178",
        "country": "Private",
        "date": "24-11-2024",
        "review": "Product received for free\n\nDecent game, but it seems like there isn't enough mechanics for teamwork, that or my teammates are always bad."
    },
    {
        "user": "Propet",
        "user_ID": "76561199013226369",
        "country": "US",
        "date": "24-11-2024",
        "review": "they destroyed a masterpiece."
    },
    {
        "user": "Enerspace",
        "user_ID": "76561198886809307",
        "country": "US",
        "date": "24-11-2024",
        "review": "game bad\nduh"
    },
    {
        "user": "Sir Thom",
        "user_ID": "76561198876410676",
        "country": "CA",
        "date": "24-11-2024",
        "review": "Lots of microtransaction lack the rule 34 art"
    },
    {
        "user": "AddyForAll",
        "user_ID": "76561198283473428",
        "country": "US",
        "date": "24-11-2024",
        "review": "Don't like it? gitgud"
    },
    {
        "user": "Formal Femto",
        "user_ID": "76561199212892876",
        "country": "IE",
        "date": "24-11-2024",
        "review": "I hate how every tank now is just a better dps. Hazard is just taking the piss"
    },
    {
        "user": "AsyncMatrix",
        "user_ID": "AsyncMatrix",
        "country": "Private",
        "date": "23-11-2024",
        "review": "legacy overwatch mode is more fun than playing any current games with the new champion."
    },
    {
        "user": "yuffer",
        "user_ID": "76561198170678030",
        "country": "US",
        "date": "23-11-2024",
        "review": "they can't even bring classic overwatch back fully\n\nthanks blizzard <3"
    },
    {
        "user": "Arock32497",
        "user_ID": "76561198167026961",
        "country": "US",
        "date": "23-11-2024",
        "review": "It's not fun man it's just not fun. I wasted 2,000 hours of my life on this game"
    },
    {
        "user": "Grunkledunkin",
        "user_ID": "76561198134288471",
        "country": "US",
        "date": "24-11-2024",
        "review": "The gameplay can be decent at times. However, in-game chat is toxic, and players are rude. Micro transactions are rampant. I've been here since OW, and I feel like they are trying to recapture what they had once but keep falling short.\n\nPros: Its free.\n\nCons: Everything else."
    },
    {
        "user": "PIgeon",
        "user_ID": "76561199370628429",
        "country": "CN",
        "date": "23-11-2024",
        "review": "the game is actually good."
    },
    {
        "user": "lavalender",
        "user_ID": "76561198891975898",
        "country": "US",
        "date": "23-11-2024",
        "review": "give venture skins ok thank you"
    },
    {
        "user": "funsuper",
        "user_ID": "funsuper",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Worst sequel of the best original Overwatch. Curse u Blizzard"
    },
    {
        "user": "sneakiboi2",
        "user_ID": "76561198397959836",
        "country": "Private",
        "date": "23-11-2024",
        "review": "don't"
    },
    {
        "user": "Mkbeeast",
        "user_ID": "76561199070314586",
        "country": "Private",
        "date": "23-11-2024",
        "review": "ok"
    },
    {
        "user": "d7my",
        "user_ID": "76561199564436123",
        "country": "KW",
        "date": "23-11-2024",
        "review": "لعبه حلوه"
    },
    {
        "user": "Lil_joey",
        "user_ID": "76561199791896882",
        "country": "US",
        "date": "23-11-2024",
        "review": "meow"
    },
    {
        "user": "Castle in the Ocean",
        "user_ID": "ArkCastle_royal",
        "country": "Private",
        "date": "23-11-2024",
        "review": "The problems started already from the moment of the account. Do I have to register my phone number?"
    },
    {
        "user": "Pázsit",
        "user_ID": "76561199052505958",
        "country": "HU",
        "date": "23-11-2024",
        "review": "i feel like a divorced alcoholic father whenever i play this shi"
    },
    {
        "user": "wyz",
        "user_ID": "76561199047684991",
        "country": "Private",
        "date": "23-11-2024",
        "review": "worst game of all time company is worse then fortnite all they care about is money and mom credit cards would not recomend i would rather learn calc from a monkey then play this game i think the got the idea of winston from the game dev please bring back jeff"
    },
    {
        "user": "Dangerclone",
        "user_ID": "76561198999735771",
        "country": "US",
        "date": "23-11-2024",
        "review": "This game isn't that bad with friends- Wouldn't play it without friends"
    },
    {
        "user": "iBin",
        "user_ID": "iVaniBin",
        "country": "Private",
        "date": "23-11-2024",
        "review": "bastion no minigun and no super gun"
    },
    {
        "user": "Jush",
        "user_ID": "76561199094989672",
        "country": "Private",
        "date": "23-11-2024",
        "review": "I like this game but I also don't like this game.. y'know what I mean"
    },
    {
        "user": "Rumoth",
        "user_ID": "Rumoth",
        "country": "Private",
        "date": "23-11-2024",
        "review": "ramattra jiggle physics when?"
    },
    {
        "user": "arc ♡",
        "user_ID": "arcvlies",
        "country": "Private",
        "date": "23-11-2024",
        "review": "ramattra jiggle physics when?"
    },
    {
        "user": "SKAL AceAnvil",
        "user_ID": "AceAnvil",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Ye its aight"
    },
    {
        "user": "MisterPebis",
        "user_ID": "76561198455567924",
        "country": "IE",
        "date": "23-11-2024",
        "review": "i only play because i love my friends, if this game exploded tomorrow i'd be so happy"
    },
    {
        "user": "Olotove",
        "user_ID": "76561198882501648",
        "country": "US",
        "date": "23-11-2024",
        "review": "Back in 2018 I played this game tons on Xbox with my friends, and we thought it was the best thing ever.\n\n..oh how the mighty have fallen"
    },
    {
        "user": "BoddyBGX",
        "user_ID": "bbucur2272",
        "country": "Private",
        "date": "23-11-2024",
        "review": "♥♥♥♥♥♥♥"
    },
    {
        "user": "nSwisz",
        "user_ID": "nSwisz",
        "country": "Private",
        "date": "23-11-2024",
        "review": "This game has finally redeemed itself after years of failure. This game used to be peak back in 2017-2020 but everything after that it was garbage. I used to play on Playstation so im new to Overwatch on K+M, but it is actually enjoyable now after years."
    },
    {
        "user": "Vitality",
        "user_ID": "76561199125979001",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Can't even load into the game, this is the worst game in the entire universe i'd rather play POSTAL 3 than this"
    },
    {
        "user": "Tmob1325",
        "user_ID": "76561198313083398",
        "country": "Private",
        "date": "23-11-2024",
        "review": "i hate this game from the bottom of my heart"
    },
    {
        "user": "pemis fard",
        "user_ID": "76561199013097753",
        "country": "CN",
        "date": "23-11-2024",
        "review": "Game used to be good. Game was hard but you could get better with practice. Sometimes things were unfair, the enemy team was better than you, or you were teamed up with idiots, but that's how things are in most games.\n\nSometimes they would add new characters who would play major roles in the story and had their own unique play style. These new characters felt like they genuinely brought something to the table and improved the game.\n\nBut then they started listening to the crybabies who grew up with no siblings. They nerfed the fun heroes until they were no longer fun. They made the unique characters less unique. Now they all kinda feel the same and not as impactful.\n\nThey started adding more and more characters, each one feeling more crude and less creative than the last. Now they feel less like they bring something to the table and more like a desperate attempt to stop you from uninstalling.\n\nTLDR: game used to be kinda small & high quality. game is now very large & low quality. don't give them any money."
    },
    {
        "user": "XD",
        "user_ID": "KarateKidBandit",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Dog water"
    },
    {
        "user": "DepthZz",
        "user_ID": "DepthZz",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Product received for free\n\nIn game purchases are still a scam..."
    },
    {
        "user": "djssl",
        "user_ID": "WHY_ARE-YOU_ON-MY_PAGE",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Makes me angry."
    },
    {
        "user": "Daimyō Uryu",
        "user_ID": "76561198119707718",
        "country": "JP",
        "date": "23-11-2024",
        "review": "*Only plays the 2016 version*"
    },
    {
        "user": "Issaiah",
        "user_ID": "76561198854665728",
        "country": "US",
        "date": "23-11-2024",
        "review": "This game sucks."
    },
    {
        "user": "ThatShyGuy",
        "user_ID": "ThatShyGuy",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Poop"
    },
    {
        "user": "Yourneighbor415",
        "user_ID": "76561199686218737",
        "country": "Private",
        "date": "23-11-2024",
        "review": "fun and fast paced, never a dull moment"
    },
    {
        "user": "LiliMarlowe",
        "user_ID": "76561199184417252",
        "country": "Private",
        "date": "23-11-2024",
        "review": "I hate to say it, but it is lots of fun to me"
    },
    {
        "user": "Linux",
        "user_ID": "76561199435404731",
        "country": "Private",
        "date": "23-11-2024",
        "review": "if it had different creator different soundtrack different community different genre different characters it might have been decent"
    },
    {
        "user": "Elcactus777",
        "user_ID": "76561199094133342",
        "country": "FR",
        "date": "23-11-2024",
        "review": "♥♥♥♥♥♥♥"
    },
    {
        "user": "quang.ttmmqq120794",
        "user_ID": "76561199471639849",
        "country": "Private",
        "date": "23-11-2024",
        "review": "terrible"
    },
    {
        "user": "Mister True",
        "user_ID": "mistertrue",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Game is bad, matchmaking is bad, the company behind it is the worst alongside Ubisoft."
    },
    {
        "user": "ghostcanine",
        "user_ID": "ghostcanine",
        "country": "Private",
        "date": "23-11-2024",
        "review": "The game has its issues but I keep coming back to it, it is what it is. Overhated."
    },
    {
        "user": "Meliodas99",
        "user_ID": "76561198851468969",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Love 1 tapping people on widow"
    },
    {
        "user": "Hermann",
        "user_ID": "76561198848533352",
        "country": "DE",
        "date": "23-11-2024",
        "review": "i never felt joy again after installing it.\nIm an addict."
    },
    {
        "user": "sKylA WyhTE yOo0",
        "user_ID": "big_str8_man",
        "country": "Private",
        "date": "23-11-2024",
        "review": "THIS GAME IS SO ♥♥♥♥!\n\nEVERY TIME I PLAY I WANT TO DIE.\n\nNOT ONCE HAVE I HAD FUN PLAYING THIS GAME.\n\nI GET PUT INTO A LOBBY WITH THIS GUY CALLED REDNW. HE PLAYS SUPPORT AND GETS 5 ASSISTS. WHAT THE FLIP IS HE DOING.\n\nIF THEY BANNED REDNW I WOULD CONSIDER PLAYING AGAIN.\n\nWHY IS MATCHINGMAKING SO BROKEN IN THIS GAME."
    },
    {
        "user": "Particleッ",
        "user_ID": "thewhox1",
        "country": "Private",
        "date": "23-11-2024",
        "review": "This game will suck your soul from your body. For some reason you and all your friends will hate it but yet continue to play it due to its \"short\" game times. Yet the queue times can range upwards of 10 minutes... . The game has unobtainable achievements from previous events and decides to match you with the most botlike AI damages in the world. Stay well away."
    },
    {
        "user": "NuckelSchorle",
        "user_ID": "76561198061139868",
        "country": "Private",
        "date": "23-11-2024",
        "review": "I hate this game!"
    },
    {
        "user": "tristanisntmissin",
        "user_ID": "76561199261374526",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Yes"
    },
    {
        "user": "Deivisproltu123",
        "user_ID": "76561198894344126",
        "country": "LT",
        "date": "23-11-2024",
        "review": "post-paid phone number my ass blizzard"
    },
    {
        "user": "Basilist17",
        "user_ID": "Basilist17",
        "country": "Private",
        "date": "23-11-2024",
        "review": "🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢"
    },
    {
        "user": "papçük",
        "user_ID": "muratinkoyluannesinisikiyim",
        "country": "Private",
        "date": "23-11-2024",
        "review": "♥♥♥♥♥♥♥ video game, praying for blizzard downfall"
    },
    {
        "user": "diamondbossyt",
        "user_ID": "76561198394539938",
        "country": "US",
        "date": "23-11-2024",
        "review": "THis game makes me wanna kms"
    },
    {
        "user": "Ichinose",
        "user_ID": "iichinose",
        "country": "Private",
        "date": "23-11-2024",
        "review": "people who make overwatch porn works harder than the people who make overwatch"
    },
    {
        "user": "tdoggs_notorious3",
        "user_ID": "76561198105124631",
        "country": "AU",
        "date": "23-11-2024",
        "review": "Product received for free\n\nits a great game"
    },
    {
        "user": "Demonations",
        "user_ID": "76561198870528879",
        "country": "BR",
        "date": "23-11-2024",
        "review": "Esse jogo é uma bosta, jogue"
    },
    {
        "user": "Manpro",
        "user_ID": "76561198880357057",
        "country": "IN",
        "date": "23-11-2024",
        "review": "What a pathetic Login system seems like some one hired an intern from a third world country to do this ,really just pathetic you guys wasted my time and internet ,you guys should be ashamed of such stunts you pull off.Seriously man what a pathetic Login system has no respect for the gamers time you guys deserves the downfall and hate ,trash company trash game ."
    },
    {
        "user": "identity theft",
        "user_ID": "cloxfr",
        "country": "Private",
        "date": "23-11-2024",
        "review": "me ooga booga 4 dps yes yes"
    },
    {
        "user": "DTW. (つ ¯ ¯ )つ",
        "user_ID": "76561198157085523",
        "country": "Private",
        "date": "23-11-2024",
        "review": "lowkey just play alone"
    },
    {
        "user": "crvx83",
        "user_ID": "pociongENJOYER",
        "country": "Private",
        "date": "23-11-2024",
        "review": "porn better"
    },
    {
        "user": "Supervisor",
        "user_ID": "76561199763936204",
        "country": "IL",
        "date": "23-11-2024",
        "review": "Wait, it's a game?"
    },
    {
        "user": "PanzerBrian",
        "user_ID": "76561199182028269",
        "country": "CA",
        "date": "23-11-2024",
        "review": "6v6 was better"
    },
    {
        "user": "Serkulio",
        "user_ID": "Serkulio",
        "country": "Private",
        "date": "23-11-2024",
        "review": "fun, bad monetization system"
    },
    {
        "user": "humblegod",
        "user_ID": "si_io",
        "country": "Private",
        "date": "23-11-2024",
        "review": "so much better than valorant and its not even close"
    },
    {
        "user": "Rayquaza6T9",
        "user_ID": "76561199334510512",
        "country": "IN",
        "date": "23-11-2024",
        "review": "This is the reason why Concord even existed in history"
    },
    {
        "user": "Doutora",
        "user_ID": "76561198277754619",
        "country": "US",
        "date": "23-11-2024",
        "review": "Just no"
    },
    {
        "user": "Noob Shot",
        "user_ID": "leddiable",
        "country": "Private",
        "date": "23-11-2024",
        "review": "From the mostly negative, I thought that this game was actually bad. But quite the contrary, it's one of the finer games but it definitely has one of the most negative communities if they are leaving negative reviews because they are mad at one thing or another. Relax, the game overall is GREAT. I love it."
    },
    {
        "user": "Sir Now",
        "user_ID": "76561198056907137",
        "country": "MY",
        "date": "23-11-2024",
        "review": "Would have prefer the old mode. But for now it seems to be available for all. Would totally recommend!"
    },
    {
        "user": "shavaizknz98",
        "user_ID": "shavaizknz98",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Don't do this to yourself"
    },
    {
        "user": "MissUBibi",
        "user_ID": "76561199050461862",
        "country": "TH",
        "date": "23-11-2024",
        "review": "So Nua"
    },
    {
        "user": "Bap Comet",
        "user_ID": "76561198924959690",
        "country": "Private",
        "date": "23-11-2024",
        "review": "So woke it's vomit inducing.\n\nEven if the game were good, which it is not, I would not recommend supporting their politically driven propaganda machine."
    },
    {
        "user": "FATDAMDAM",
        "user_ID": "76561199085950540",
        "country": "SA",
        "date": "23-11-2024",
        "review": "just get a life man"
    },
    {
        "user": "𝐿𝑒𝓂𝑜𝓃",
        "user_ID": "lemonjuice01",
        "country": "Private",
        "date": "23-11-2024",
        "review": "After 30 hours played: The only balance I've ever seen in this game:\nGameplay 𐄂\nWidowmaker butt ✓ ( Perfect balance )"
    },
    {
        "user": "VanderCat",
        "user_ID": "VanderOfCat",
        "country": "Private",
        "date": "23-11-2024",
        "review": "ovewrach"
    },
    {
        "user": "McFrick",
        "user_ID": "76561199385117567",
        "country": "US",
        "date": "23-11-2024",
        "review": "You should not be penalized for your internet dropping, I have been punished for ♥♥♥♥♥♥ internet. I am also forced to play through the entire match even if my team mates are throwing the game. THIS IS ALL IN QUICKPLAY!"
    },
    {
        "user": "White Sparrow",
        "user_ID": "76561198967631523",
        "country": "Private",
        "date": "23-11-2024",
        "review": "its good game if you love fortnite"
    },
    {
        "user": "wraith",
        "user_ID": "76561199227866161",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Product received for free\n\nPlease don't play this game, developers are lazy as ♥♥♥♥ when they do skins and they love to recolour SKINS bro. tanks are all the same cocky personalities, kiriko is some weird self insert, prices here are jacked up and at this point im doing self harm by playing this game and having to argue with teammates that dont make sense sometimes, get me out of this game. thank you."
    },
    {
        "user": "Pancakes",
        "user_ID": "76561198155622198",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Despite the negative reviews, i'm personally having a blast. Yes some of the changes are garbage, but I can overlook it enough to enough a solid game."
    },
    {
        "user": "Ghostface",
        "user_ID": "Ghostface--__",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Just don't play this game, there's so many better games to be playing. let this dumpster fire burn."
    },
    {
        "user": "rowskey",
        "user_ID": "76561197998147492",
        "country": "US",
        "date": "23-11-2024",
        "review": "A shadow of its former self. Classic was great for a while, but the game is as corrupt as those that control it now."
    },
    {
        "user": "Zerohero",
        "user_ID": "Zeroheronomorehero",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Game tolol"
    },
    {
        "user": "Brainy",
        "user_ID": "76561199519280031",
        "country": "Private",
        "date": "23-11-2024",
        "review": "gay"
    },
    {
        "user": "Straydog",
        "user_ID": "76561198402799472",
        "country": "US",
        "date": "23-11-2024",
        "review": "you cant play this without a phone number so no"
    },
    {
        "user": "AxZ Vortex",
        "user_ID": "76561198869796814",
        "country": "US",
        "date": "23-11-2024",
        "review": "i hate this ga,me"
    },
    {
        "user": "Krabs",
        "user_ID": "76561199214801506",
        "country": "Private",
        "date": "23-11-2024",
        "review": "game so bad I started playing fortnite again"
    },
    {
        "user": "Thukz",
        "user_ID": "Thukzzz",
        "country": "Private",
        "date": "23-11-2024",
        "review": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣤⣤⣤⣤⣶⣦⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⡿⠛⠉⠙⠛⠛⠛⠛⠻⢿⣿⣷⣤⡀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⠋⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⠈⢻⣿⣿⡄⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⣸⣿⡏⠀⠀⠀⣠⣶⣾⣿⣿⣿⠿⠿⠿⢿⣿⣿⣿⣄⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⠁⠀⠀⢰⣿⣿⣯⠁⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣷⡄⠀\n⠀⠀⣀⣤⣴⣶⣶⣿⡟⠀⠀⠀⢸⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣷⠀\n⠀⢰⣿⡟⠋⠉⣹⣿⡇⠀⠀⠀⠘⣿⣿⣿⣿⣷⣦⣤⣤⣤⣶⣶⣶⣶⣿⣿⣿⠀\n⠀⢸⣿⡇⠀⠀⣿⣿⡇⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠀\n⠀⣸⣿⡇⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠉⠻⠿⣿⣿⣿⣿⡿⠿⠿⠛⢻⣿⡇⠀⠀\n⠀⣿⣿⠁⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣧⠀⠀\n⠀⣿⣿⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀\n⠀⣿⣿⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀\n⠀⢿⣿⡆⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⡇⠀⠀\n⠀⠸⣿⣧⡀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠃⠀⠀\n⠀⠀⠛⢿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⣰⣿⣿⣷⣶⣶⣶⣶⠶⠀⢠⣿⣿⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⣿⣿⡇⠀⣽⣿⡏⠁⠀⠀⢸⣿⡇⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⣿⣿⡇⠀⢹⣿⡆⠀⠀⠀⣸⣿⠇⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⢿⣿⣦⣄⣀⣠⣴⣿⣿⠁⠀⠈⠻⣿⣿⣿⣿⡿⠏⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠈⠛⠻⠿⠿⠿⠿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
    },
    {
        "user": "VirtualSlayer10",
        "user_ID": "76561199145769651",
        "country": "Private",
        "date": "23-11-2024",
        "review": "This game is like an abusive relationship without any of the fun parts. Which makes sense since the devs were so bent on sexually abusing their employees anyway, it creates the insanely realistic feel of the anguish these employees felt while creating the game. Ranked is either steamrolling or getting steam rolled because matchmaking wants you to stay so you spend money but that also means you get steamrolled by somebody else in return. Do not start playing this game, it is not worth starting as a new player.\nDo not continue playing this game, it is not worth your sanity. Do not spend money on this game, it is not worth filling the pockets of somebody who likes putting his hands where they don't belong."
    },
    {
        "user": "SCR0N",
        "user_ID": "scottylol",
        "country": "Private",
        "date": "23-11-2024",
        "review": ":)"
    },
    {
        "user": "Sap",
        "user_ID": "76561199572003858",
        "country": "Private",
        "date": "23-11-2024",
        "review": "I hate this game."
    },
    {
        "user": "JW_G",
        "user_ID": "76561199128302329",
        "country": "US",
        "date": "23-11-2024",
        "review": "Overwatch but with a 2 behind it"
    },
    {
        "user": "mjnjng dream",
        "user_ID": "76561199636929990",
        "country": "Private",
        "date": "23-11-2024",
        "review": "meow^^"
    },
    {
        "user": "shenryu",
        "user_ID": "76561198375887792",
        "country": "Private",
        "date": "23-11-2024",
        "review": "no"
    },
    {
        "user": "Rutile",
        "user_ID": "76561199411396091",
        "country": "SE",
        "date": "23-11-2024",
        "review": "Product received for free\n\nTHIS ♥♥♥♥ ASS"
    },
    {
        "user": "Tankless",
        "user_ID": "76561198145272226",
        "country": "Private",
        "date": "23-11-2024",
        "review": "they brought back 1.0 just to ruin it and go back on their promises"
    },
    {
        "user": "Jaya",
        "user_ID": "Jrin_DF",
        "country": "Private",
        "date": "23-11-2024",
        "review": "I have cancer"
    },
    {
        "user": "king julian",
        "user_ID": "76561198799214246",
        "country": "Private",
        "date": "23-11-2024",
        "review": "This game is ass :("
    },
    {
        "user": "rydordi",
        "user_ID": "76561199448792560",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Product received for free\n\non skibidi dis ♥♥♥♥ fire (it makes me want to bomb a home of 4)"
    },
    {
        "user": "mojodojo",
        "user_ID": "76561198954246234",
        "country": "Private",
        "date": "23-11-2024",
        "review": "bad game lol. cant wait for 6v6 thanks blizz"
    },
    {
        "user": "redwinter",
        "user_ID": "76561198263610800",
        "country": "Private",
        "date": "23-11-2024",
        "review": "game good, company bad\nfine with beer"
    },
    {
        "user": "Creepypasta",
        "user_ID": "76561198998751791",
        "country": "IN",
        "date": "23-11-2024",
        "review": "Good 5 V 5 game"
    },
    {
        "user": "the pube plucker",
        "user_ID": "76561198964287667",
        "country": "Private",
        "date": "23-11-2024",
        "review": "this game is so ♥♥♥♥♥♥♥ ass"
    },
    {
        "user": "Skinnypig Gaming",
        "user_ID": "76561199219831090",
        "country": "Private",
        "date": "23-11-2024",
        "review": "its overwatch2"
    },
    {
        "user": "kainodash",
        "user_ID": "76561199642057577",
        "country": "Private",
        "date": "23-11-2024",
        "review": "♥♥♥♥"
    },
    {
        "user": "Bapu",
        "user_ID": "76561198191048571",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Great to play with your friends."
    },
    {
        "user": "Robo_Birds",
        "user_ID": "76561199396419742",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Fun Game, cool Characters and Lore. Toxic community"
    },
    {
        "user": "Zyem_",
        "user_ID": "76561199519889392",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Product received for free\n\nif you like your mental state, stay away from this game."
    },
    {
        "user": "CEO of Money",
        "user_ID": "Bbyface_YT",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Absolute ♥♥♥♥ game with trash balancing and a trillion smurfs. Do NOT recommend playing this hot pile of diarrhea."
    },
    {
        "user": "Dig Bog",
        "user_ID": "s4tivaaa",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Overwatch 2 many ways to pay for things that used to be earnable."
    },
    {
        "user": "Chadshaka",
        "user_ID": "Chadshaka",
        "country": "Private",
        "date": "23-11-2024",
        "review": "They haven't released a original hero since Sigma, broken promises at launch, yada yada. Listen I'm doing my part in hating this pile of ♥♥♥♥♥♥♥."
    },
    {
        "user": "Nah That's Just iPod",
        "user_ID": "76561199023302937",
        "country": "US",
        "date": "23-11-2024",
        "review": "the playerbase is beyond lost, this game became a comedy."
    },
    {
        "user": "Björk",
        "user_ID": "76561199387969359",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Product received for free\n\newbwdbw"
    },
    {
        "user": "Cronkossfer",
        "user_ID": "76561199032517175",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Product received for free\n\novercrotch is a game that wants to be TF2. How good it is depends on your team. so based on the most recent game, it's alright I guess"
    },
    {
        "user": "T0WKR",
        "user_ID": "76561198960032864",
        "country": "US",
        "date": "23-11-2024",
        "review": "Still better than Valorant in my opinion"
    },
    {
        "user": "PB_Rocket",
        "user_ID": "76561199387263088",
        "country": "Private",
        "date": "23-11-2024",
        "review": "idc what anyone says this is a great game"
    },
    {
        "user": "ChocolateCookies",
        "user_ID": "76561199560433480",
        "country": "Private",
        "date": "23-11-2024",
        "review": "I've been playing overwatch for a little over a year now and i have really enjoyed the game even though it has done some things i don't agree with it has done more thing ive like/enjoyed that most people overlook the with the bad things blizzard has done to the game over the countless years i believe it is still a pretty damn good game."
    },
    {
        "user": "ChaoticMar",
        "user_ID": "76561199097575750",
        "country": "US",
        "date": "23-11-2024",
        "review": "Sign in with main email from existing account.\nDidn't work.\nCreate new email (phone number optional).\nOh wait jk we *hate* you. You do actually need to put in your phone number oopsie daisy.\nPut in phone number.\nIt's connected to the main email. Which I can't use.\n\nThaaaaaaanks."
    },
    {
        "user": "NoZen",
        "user_ID": "76561199119834357",
        "country": "PH",
        "date": "23-11-2024",
        "review": "Actual dogwater game, loading into a game takes so long that I get booted off due to inactivity, my PC literally has a decent specs I'm not understanding how this game even works. If your PC isn't even running a RTX 3050 (which is a below average GPU) don't even bother playing, you'll spend more time waiting for the suspension to be lifted than playing the actual game."
    },
    {
        "user": "Carrotking",
        "user_ID": "76561199039095401",
        "country": "VG",
        "date": "23-11-2024",
        "review": "bad"
    },
    {
        "user": "ShadowbURN",
        "user_ID": "Dwight55566",
        "country": "Private",
        "date": "23-11-2024",
        "review": "SUCH A TRASH GAME I HOPE WHO EVER DEVOLP THIS GAME GO TO ♥♥♥♥♥♥♥♥ HELL AND A BIG FIRE SNAKE GOES INTO HIS ♥♥♥♥♥♥♥ THIS GAME IS SO ♥♥♥♥ BRING BACK OVERWATCH 1 U ♥♥♥♥♥"
    },
    {
        "user": "TaPaKaH",
        "user_ID": "76561199574894207",
        "country": "RW",
        "date": "23-11-2024",
        "review": "good game bad players"
    },
    {
        "user": "Black Women HMU",
        "user_ID": "76561199005730104",
        "country": "US",
        "date": "23-11-2024",
        "review": "sucks ass"
    },
    {
        "user": "fox",
        "user_ID": "76561199238347299",
        "country": "Private",
        "date": "23-11-2024",
        "review": "game is trash."
    },
    {
        "user": "SoySaucyTTV",
        "user_ID": "76561199205462305",
        "country": "Private",
        "date": "23-11-2024",
        "review": "yes"
    },
    {
        "user": "Gyunli",
        "user_ID": "76561198799154209",
        "country": "GB",
        "date": "23-11-2024",
        "review": "♥♥♥♥ hanzo"
    },
    {
        "user": "JaytheBird",
        "user_ID": "76561198873361886",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Surprisingly enjoyable, unless I have a match with Hazard in it :3\nNerf him, wtf were you thinking. :("
    },
    {
        "user": "Clyde0451",
        "user_ID": "76561198826930424",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Guys, relax. Overwatch 2 Offers so much new stuff : There is the battlepass, The Shop, 5 Different purchasable currencies. If you ever feel like you're too late to the party - overwatch has GOT YOU COVERED !!! there are less features than EVER. with the new and improved - \"Removed Find Group\" Feature you will always be alone, except for the shop of course. With the game removing any sort of fun and moving all progression towards useless disgusting cosmetics, you can trust overwatch to deliver hundreds of pointless unending hours of grind, for little to no reward. And remember this was a game before !"
    },
    {
        "user": "Ninety9Balloons",
        "user_ID": "Ninety9Balloons",
        "country": "Private",
        "date": "23-11-2024",
        "review": "Matchmaking is broken, somehow, since the game launched and the chances of getting an actual good game between to balanced teams is 1 in 5 games, maybe.\n\nThe hitboxes for headshots are still comically large, making it really stupid when you (or someone else) just wildly swings the mouse around when shooting yet still nailing a headshot across the map."
    },
    {
        "user": "Schokozucci",
        "user_ID": "Schokozucci",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Download the game, play a bit, write a bad review, Uninstall the game\n⣿⣿⣿⣿⣿⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢿⣿⣿⣿⣿\n⣿⣿⣿⣿⡏⣀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿\n⣿⣿⣿⢏⣴⣿⣷⠀⠀⠀⠀⠀⢾⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿\n⣿⣿⣟⣾⣿⡟⠁⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣷⢢⠀⠀⠀⠀⠀⠀⠀⢸⣿\n⣿⣿⣿⣿⣟⠀⡴⠄⠀⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⣿\n⣿⣿⣿⠟⠻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠶⢴⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⣿\n⣿⣁⡀⠀⠀⢰⢠⣦⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⡄⠀⣴⣶⣿⡄⣿\n⣿⡋⠀⠀⠀⠎⢸⣿⡆⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⠗⢘⣿⣟⠛⠿⣼\n⣿⣿⠋⢀⡌⢰⣿⡿⢿⡀⠀⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣧⢀⣼\n⣿⣿⣷⢻⠄⠘⠛⠋⠛⠃⠀⠀⠀⠀⠀⢿⣧⠈⠉⠙⠛⠋⠀⠀⠀⣿⣿⣿⣿⣿\n⣿⣿⣧⠀⠈⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠟⠀⠀⠀⠀⢀⢃⠀⠀⢸⣿⣿⣿⣿\n⣿⣿⡿⠀⠴⢗⣠⣤⣴⡶⠶⠖⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡸⠀⣿⣿⣿⣿\n⣿⣿⣿⡀⢠⣾⣿⠏⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠉⠀⣿⣿⣿⣿\n⣿⣿⣿⣧⠈⢹⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿\n⣿⣿⣿⣿⡄⠈⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣾⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣦⣄⣀⣀⣀⣀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠙⣿⣿⡟⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠁⠀⠀⠹⣿⠃⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⡿⠛⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢐⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⠿⠛⠉⠉⠁⠀⢻⣿⡇⠀⠀⠀⠀⠀⠀⢀⠈⣿⣿⡿⠉⠛⠛⠛⠉⠉\n⣿⡿⠋⠁⠀⠀⢀⣀⣠⡴⣸⣿⣇⡄⠀⠀⠀⠀⢀⡿⠄⠙⠛⠀⣀⣠⣤⣤⠄"
    },
    {
        "user": "Goose",
        "user_ID": "76561198882272524",
        "country": "Private",
        "date": "22-11-2024",
        "review": "peak"
    },
    {
        "user": "[FF019B]꧁H҉A҉C҉K҉E҉R҉꧂",
        "user_ID": "76561199590772184",
        "country": "Private",
        "date": "22-11-2024",
        "review": "good"
    },
    {
        "user": "poobert",
        "user_ID": "76561198144467954",
        "country": "US",
        "date": "22-11-2024",
        "review": "Product received for free\n\ni despise this game but at the same time it is so addicting"
    },
    {
        "user": "Fruity",
        "user_ID": "76561199490341024",
        "country": "Private",
        "date": "22-11-2024",
        "review": "bchd"
    },
    {
        "user": ".niqo",
        "user_ID": "76561198130650201",
        "country": "Private",
        "date": "22-11-2024",
        "review": "All the captchas and verification just to force me to give them my number anyway. Nah, I'm good."
    },
    {
        "user": "malnie",
        "user_ID": "76561198256579163",
        "country": "Private",
        "date": "22-11-2024",
        "review": "its good, fun."
    },
    {
        "user": "Toetoe",
        "user_ID": "thetoetoe",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Don't take it too seriously and it's a good time"
    },
    {
        "user": "xxRcggie",
        "user_ID": "76561199229681554",
        "country": "Private",
        "date": "22-11-2024",
        "review": "l"
    },
    {
        "user": "kreededalt",
        "user_ID": "kreedencedalt",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Product received for free\n\nThere is a lot of people who rate this game harshly because they take it very serious. I know it is a competitive game however most people do not seem to be playing this for fun anymore. You can definitely make it fun no matter what the \"meta\" is, having friends to play with will help. People can be toxic but are very open to humor and enjoying the game, so just keep it positive and you should be w/o problems except for a few petty messages."
    },
    {
        "user": "𝕺𝖓𝖊",
        "user_ID": "belicona",
        "country": "Private",
        "date": "22-11-2024",
        "review": "this game is more broken than the greek economy jesus christ"
    },
    {
        "user": "Joe Dirt",
        "user_ID": "joedirt1428",
        "country": "Private",
        "date": "22-11-2024",
        "review": "I like this game but there is too many smurfs with ten accounts from OW1.\nHopefully Marvel Rivals will return this genre to glory."
    },
    {
        "user": "abunaif",
        "user_ID": "76561199767559671",
        "country": "Private",
        "date": "22-11-2024",
        "review": "wow"
    },
    {
        "user": "nynjato",
        "user_ID": "76561197981420936",
        "country": "US",
        "date": "22-11-2024",
        "review": "i hate this game but i cant stop"
    },
    {
        "user": "Thomsup",
        "user_ID": "Thomsup",
        "country": "Private",
        "date": "22-11-2024",
        "review": "No emote of roadhog all oiled up and twerking"
    },
    {
        "user": "Pumpkin Carving",
        "user_ID": "Obamajuyh",
        "country": "Private",
        "date": "22-11-2024",
        "review": "It fun"
    },
    {
        "user": "Coca",
        "user_ID": "76561198036679808",
        "country": "GB",
        "date": "22-11-2024",
        "review": "ow1 was better"
    },
    {
        "user": "Gary DROP.SKIN",
        "user_ID": "76561199046210355",
        "country": "ES",
        "date": "22-11-2024",
        "review": "Nice game"
    },
    {
        "user": "Twosty",
        "user_ID": "76561199246138450",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Product received for free\n\nTerrible game overall, but im addicted"
    },
    {
        "user": "Hyper",
        "user_ID": "76561198038929904",
        "country": "Private",
        "date": "22-11-2024",
        "review": "I main Moira and its easy. To many noobs crying about how toxic it is. Freaks."
    },
    {
        "user": "mpmiller5",
        "user_ID": "76561199654107342",
        "country": "Private",
        "date": "22-11-2024",
        "review": "fun"
    },
    {
        "user": "NOPPA",
        "user_ID": "76561199194012024",
        "country": "Private",
        "date": "22-11-2024",
        "review": "ok"
    },
    {
        "user": "ARRE_0606",
        "user_ID": "76561199522149332",
        "country": "SE",
        "date": "22-11-2024",
        "review": "gay"
    },
    {
        "user": "Norion Winter",
        "user_ID": "76561199044457882",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Pay for overwatch porn > Play overwatch"
    },
    {
        "user": "lyfe",
        "user_ID": "76561199045604043",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Product received for free\n\nDUDEEEE TOUCHH!!!!"
    },
    {
        "user": "Young Thugnugget",
        "user_ID": "76561199580497294",
        "country": "Private",
        "date": "22-11-2024",
        "review": "i love this game"
    },
    {
        "user": "Official Aidonny Lemon Pirate",
        "user_ID": "aidonny",
        "country": "Private",
        "date": "22-11-2024",
        "review": "I'' b## /ll O:A:"
    },
    {
        "user": "Eleos",
        "user_ID": "76561198811578662",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Blizzard is greedy as hell. Game hasn't had an update better than mediocre in centuries. I cant take it seriously unless i wanna kill myself because everything about the matchmaking, hero balancing, and role balancing makes me think a monkey with the brain capacity of a moldy slice of bread was their lead dev"
    },
    {
        "user": "Vita-Aeternus",
        "user_ID": "76561199645070962",
        "country": "AQ",
        "date": "22-11-2024",
        "review": "Alright, This game isn't really all that bad but it doesn't go without having a fair share to complain about. The original is so much better and they couldn't even accomplish what it had going for it originally with the new classic mode; too many things are changed and the originally overpowered heroes are still overpowered. In the new stuff its the same, a lot of over powered heroes or heroes that people play as exclusively because they're smurfing. I can't personally recommend it to most people but if it suits you then by all means, enjoy it as much as you can."
    },
    {
        "user": "Mrkvica",
        "user_ID": "76561198800286402",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Not only does this game no longer accept the account I created when installing the original Owerwatch back when it first launched, it now does not allow me to play it, as creating a new account (with the same unrecognized email from years ago) is so painfully slow as nothing works and nothing is recognized.\n\nNot only did I spend my money when the game came out but I am now spending time just trying to play the game. 0/10"
    },
    {
        "user": "DarkCrysis101",
        "user_ID": "HelloThereRandomStranger",
        "country": "Private",
        "date": "22-11-2024",
        "review": "came back to play classic, had fun, then i remember Im playing Overwatch 2. So this isnt the primary game mode. Which made me realise how bad overwatch 2 compare to the test version."
    },
    {
        "user": "Blue Moon",
        "user_ID": "FunnyDab",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Overwatch :("
    },
    {
        "user": "Green",
        "user_ID": "76561198310321760",
        "country": "Private",
        "date": "22-11-2024",
        "review": "don't do this to yourself"
    },
    {
        "user": "60Hz90FPS80msToGlobal",
        "user_ID": "76561198198638799",
        "country": "Private",
        "date": "22-11-2024",
        "review": "always error apply update 0"
    },
    {
        "user": "arfatf5m",
        "user_ID": "76561199472584295",
        "country": "Private",
        "date": "22-11-2024",
        "review": "my life was destroyed i got no money no family no wife no children and no job. but after playing ow2 nothing changed but it was fun"
    },
    {
        "user": "Dadd",
        "user_ID": "76561198443540495",
        "country": "VN",
        "date": "22-11-2024",
        "review": "the sms is ♥♥♥♥♥ mess just want to play the ♥♥♥♥♥ game."
    },
    {
        "user": "Miret74",
        "user_ID": "76561199415887316",
        "country": "Private",
        "date": "22-11-2024",
        "review": "ada"
    },
    {
        "user": "Ongchi",
        "user_ID": "johnchiong",
        "country": "Private",
        "date": "22-11-2024",
        "review": "I wanted to play with friends but the log in authenticator and all ruined it. BYE BYE"
    },
    {
        "user": "Dwllr",
        "user_ID": "76561198994356120",
        "country": "US",
        "date": "22-11-2024",
        "review": "I'd rather eat ♥♥♥♥♥♥♥♥ and pour bleach in my eyes, then cut my own ♥♥♥♥ off than play this game. 10/10"
    },
    {
        "user": "GreekGod28Zeus",
        "user_ID": "76561199491295131",
        "country": "GR",
        "date": "22-11-2024",
        "review": "I originally used to play on Xbox back in the original \"OW 1\" days and while PC is easier to play with now.\ndear god of whatever religion listens this is not OW anymore it is a dying husk.\n\nBlizzard what the f-c-k have you done to such a fun game, cinematics gone, lore evaporated, fun skins to useless recolors, PVE was a lie from the start. id say they f-ed the game harder than Mei gets in \"those videos\" but its not even a joke for this game, overwatch is sad now. here's hoping some intern at blizz gives this game a graceful death by unplugging the servers soon."
    },
    {
        "user": "THO00M",
        "user_ID": "76561198199541859",
        "country": "Private",
        "date": "22-11-2024",
        "review": "the in game purchases are insane"
    },
    {
        "user": "Puppe",
        "user_ID": "singingmons",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Don't play this game"
    },
    {
        "user": "komaru",
        "user_ID": "havyiu",
        "country": "Private",
        "date": "22-11-2024",
        "review": "i wish i never got this game"
    },
    {
        "user": "BalaX",
        "user_ID": "76561198206453320",
        "country": "HR",
        "date": "22-11-2024",
        "review": "Chat censorship in this is absurd, put mute player option for snowflakes that can't stand a bit of smack talk, what a joke of a game and a company. Getting a 14 day chat ban over some bAd nO-No wOrDs"
    },
    {
        "user": "Medzaga",
        "user_ID": "76561198967678368",
        "country": "Private",
        "date": "22-11-2024",
        "review": "I had more fun looking at the Reviews than playing the actual GAME"
    },
    {
        "user": "katakuna",
        "user_ID": "76561199187689575",
        "country": "RO",
        "date": "22-11-2024",
        "review": "i can dyna jump"
    },
    {
        "user": "OutOfOrder404",
        "user_ID": "76561199018461329",
        "country": "Private",
        "date": "22-11-2024",
        "review": "FIRE IN THE HOLLLEEE"
    },
    {
        "user": "Dementor",
        "user_ID": "rifkiray",
        "country": "Private",
        "date": "22-11-2024",
        "review": "good"
    },
    {
        "user": "Sir Toastie",
        "user_ID": "meep12345",
        "country": "Private",
        "date": "22-11-2024",
        "review": "In an attempt to drain more money from their players, they've completely neutered what was once a great game.\n\nBattle is just lackluster these days. Matchmaking isn't \"matching\" anything useful. The use of skills has been severely downplayed. What was once a fun lootbox system is now a battle pass where everything interesting is pay-gated.\n\nEnschittification has taken this one, unfortunately."
    },
    {
        "user": "👑 iSaynexᴳᵒˢᶹ ☢",
        "user_ID": "TheBossDark",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Competitive play is full of trolls, they don't advance the objective, they grab you with Lifeweaver and then throw you into the void, or they just leave the game.\n\nAnd if you complain, like animals that follow a leader, they denounce you in groups and you end up silenced.\n\nQuick games are the \"best\" there are currently."
    },
    {
        "user": "coffee",
        "user_ID": "76561198141018867",
        "country": "Private",
        "date": "22-11-2024",
        "review": "fun"
    },
    {
        "user": "jarzinho jr baller",
        "user_ID": "76561199122412832",
        "country": "Private",
        "date": "22-11-2024",
        "review": "really fun game <3"
    },
    {
        "user": "zohaibabbas04",
        "user_ID": "76561198884353820",
        "country": "Private",
        "date": "22-11-2024",
        "review": "good"
    },
    {
        "user": "Lofington II",
        "user_ID": "76561199787675381",
        "country": "GB",
        "date": "22-11-2024",
        "review": "i hate this game, truly. all of my tanks are social rejects who dont know right from left."
    },
    {
        "user": "pectoral",
        "user_ID": "pectoralsteam",
        "country": "Private",
        "date": "22-11-2024",
        "review": "It's one of those games where it's fun in theory if everything goes right but often it falls flat and your enjoyment is ruined."
    },
    {
        "user": "IdanFN",
        "user_ID": "76561198825690029",
        "country": "Private",
        "date": "22-11-2024",
        "review": "this game makes me sick dont play it!"
    },
    {
        "user": "IronlordSama",
        "user_ID": "76561198328636355",
        "country": "Private",
        "date": "22-11-2024",
        "review": "copium"
    },
    {
        "user": "playerone",
        "user_ID": "p1_x",
        "country": "Private",
        "date": "22-11-2024",
        "review": "corp greed ruined my fav game"
    },
    {
        "user": "Yú",
        "user_ID": "ezadrazak",
        "country": "Private",
        "date": "22-11-2024",
        "review": "."
    },
    {
        "user": "Blinkers",
        "user_ID": "76561199545147287",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Product received for free\n\nI've been playing since Overwatch 1 and Overwatch 2 is just such a HUGE improvement more frequent updates, new cool characters, new strategies and mechanics, more fun and hope for Overwatchs future."
    },
    {
        "user": "Benz0matic",
        "user_ID": "ScottyBee",
        "country": "Private",
        "date": "22-11-2024",
        "review": "sfe"
    },
    {
        "user": "arvss",
        "user_ID": "76561198850137041",
        "country": "PH",
        "date": "22-11-2024",
        "review": "no"
    },
    {
        "user": "텅스텐 볼 가방",
        "user_ID": "76561198931364895",
        "country": "EE",
        "date": "22-11-2024",
        "review": "♥♥♥♥ this game, the balances are so awful"
    },
    {
        "user": "Valhalla Rekkr",
        "user_ID": "vespado",
        "country": "Private",
        "date": "22-11-2024",
        "review": "what happened to this game..."
    },
    {
        "user": "Buirgir",
        "user_ID": "76561198851506669",
        "country": "SE",
        "date": "22-11-2024",
        "review": "Would you rather have unlimited bacon, but no games- or games... unlimited games. But no games?"
    },
    {
        "user": "chillaxdud",
        "user_ID": "chchchccat",
        "country": "Private",
        "date": "22-11-2024",
        "review": "♥♥♥♥ game bro"
    },
    {
        "user": "turbzz",
        "user_ID": "76561199635174085",
        "country": "Private",
        "date": "22-11-2024",
        "review": "absolute W game would recommend u play idk why so many people quit this game is completely underated"
    },
    {
        "user": "winton",
        "user_ID": "wintonpuncake",
        "country": "Private",
        "date": "22-11-2024",
        "review": "sad winton :("
    },
    {
        "user": "Cosmic_apple",
        "user_ID": "76561199226617561",
        "country": "Private",
        "date": "22-11-2024",
        "review": "good"
    },
    {
        "user": "HuskyMatix35mPL",
        "user_ID": "76561198124384525",
        "country": "Private",
        "date": "22-11-2024",
        "review": "F this game overwatch 2, Overwatch 1 this best"
    },
    {
        "user": "Good boy...",
        "user_ID": "Ferni76",
        "country": "Private",
        "date": "22-11-2024",
        "review": "i would rather watch paint dry on a wall."
    },
    {
        "user": "Freakshow879",
        "user_ID": "76561198883516665",
        "country": "Private",
        "date": "22-11-2024",
        "review": "yes'"
    },
    {
        "user": "CattyIsland988",
        "user_ID": "76561199641744876",
        "country": "Private",
        "date": "22-11-2024",
        "review": "So let me give my own review of this game, I like it and have been playing this game for a long time (mainly on console and since 2017/2018), but the dev's are completely incompetent at making it better. When they add a new patch it is completely and utterly wrong, just wrong, recently they buffed Doomfist when he really did not need it. Also they gave a character that just holds a button and doesn't need to aim more buffs. Like really. (Moira btw). The characters that need buffs wont receive them. There is also so much toxicity and what is called counterwatch (which is where people just switch to the character that directly counters another character.) Oh also you wanna communicate with your team and socialize watch out you say a single curse word you get suspended and that is that. No wonder there are so many smurfs and people who don't socialize because they don't wanna not be able to play for two weeks. But they don't put as much effort in banning blatant cheaters who are spin-botting in every game. Like this game is laughable it's such a joke, their attempts at improving the game just make it worse. Oh also if you look at when everyone is playing the game and having fun is when they buff Reinhardt because playing tank is just stupid anyway.\n\n\n!!!!!!!!!!!!So note if you wanna get into this game maybe consider playing a better game to spend your time on because they are just making this game worse!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nHope this review diverts people from starting this garbage game."
    },
    {
        "user": "Ranger",
        "user_ID": "76561198139093428",
        "country": "Private",
        "date": "22-11-2024",
        "review": "love getting kicked for being afk despite not being afk, well done game\n\ni am leaving this review solely out of tilt. get ♥♥♥♥♥♥"
    },
    {
        "user": "cubabori",
        "user_ID": "bori",
        "country": "Private",
        "date": "22-11-2024",
        "review": "i'd rather dip my dingleberry in a deep fryer than be sentenced to a match of Overdose."
    },
    {
        "user": "YourBestFriendKareem",
        "user_ID": "KareemHills",
        "country": "Private",
        "date": "22-11-2024",
        "review": "this game's verification process feels like im getting my balls put under 6.3 trillion newtons of force while tripping on 95 drops of lsd straight from skid row (fentanyl included)\n\ni would rather scoop my eyes out with a spoon and perforate my eardrums with a q tip like im ramming cannon balls down a flesh mortar than ever go through their busted ass account creation process. i want this game to be removed from the same timeline as me. if you asked me to compare japanese human experiments during the height of ww2 with the human verification screen on blizzard's website, i would be hard pressed to spot any distinguishable differences.\n\ni was never able to play the game. i hope blizzard goes bankrupt and the ceo ends up homeless."
    },
    {
        "user": "Jarmz",
        "user_ID": "76561199067937098",
        "country": "Private",
        "date": "22-11-2024",
        "review": "What did they do to my beloved Lucio omg this is terrible"
    },
    {
        "user": "De1thz",
        "user_ID": "76561199498264362",
        "country": "Private",
        "date": "22-11-2024",
        "review": "Game is A$$ gng ♥♥♥♥ got me losing brain cells and growing extra chromosomes"
    },
    {
        "user": "YouR_DM",
        "user_ID": "76561198800801825",
        "country": "Private",
        "date": "22-11-2024",
        "review": "The game does not even load anymore"
    },
    {
        "user": "aamirk4215",
        "user_ID": "76561199167738897",
        "country": "Private",
        "date": "22-11-2024",
        "review": "the porn is fire"
    }
]